espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_reg.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** HP_SYS_VER_DATE_REG register
 *  NA
 */
#define HP_SYS_VER_DATE_REG (DR_REG_HP_SYS_BASE + 0x0)
/** HP_REG_VER_DATE : R/W; bitpos: [31:0]; default: 539165977;
 *  NA
 */
#define HP_REG_VER_DATE    0xFFFFFFFFU
#define HP_REG_VER_DATE_M  (HP_REG_VER_DATE_V << HP_REG_VER_DATE_S)
#define HP_REG_VER_DATE_V  0xFFFFFFFFU
#define HP_REG_VER_DATE_S  0

/** HP_CLK_EN_REG register
 *  NA
 */
#define HP_CLK_EN_REG (DR_REG_HP_SYS_BASE + 0x4)
/** HP_REG_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define HP_REG_CLK_EN    (BIT(0))
#define HP_REG_CLK_EN_M  (HP_REG_CLK_EN_V << HP_REG_CLK_EN_S)
#define HP_REG_CLK_EN_V  0x00000001U
#define HP_REG_CLK_EN_S  0

/** HP_CPU_INT_FROM_CPU_0_REG register
 *  NA
 */
#define HP_CPU_INT_FROM_CPU_0_REG (DR_REG_HP_SYS_BASE + 0x10)
/** HP_CPU_INT_FROM_CPU_0 : R/W; bitpos: [0]; default: 0;
 *  set 1 will triger a interrupt
 */
#define HP_CPU_INT_FROM_CPU_0    (BIT(0))
#define HP_CPU_INT_FROM_CPU_0_M  (HP_CPU_INT_FROM_CPU_0_V << HP_CPU_INT_FROM_CPU_0_S)
#define HP_CPU_INT_FROM_CPU_0_V  0x00000001U
#define HP_CPU_INT_FROM_CPU_0_S  0

/** HP_CPU_INT_FROM_CPU_1_REG register
 *  NA
 */
#define HP_CPU_INT_FROM_CPU_1_REG (DR_REG_HP_SYS_BASE + 0x14)
/** HP_CPU_INT_FROM_CPU_1 : R/W; bitpos: [0]; default: 0;
 *  set 1 will triger a interrupt
 */
#define HP_CPU_INT_FROM_CPU_1    (BIT(0))
#define HP_CPU_INT_FROM_CPU_1_M  (HP_CPU_INT_FROM_CPU_1_V << HP_CPU_INT_FROM_CPU_1_S)
#define HP_CPU_INT_FROM_CPU_1_V  0x00000001U
#define HP_CPU_INT_FROM_CPU_1_S  0

/** HP_CPU_INT_FROM_CPU_2_REG register
 *  NA
 */
#define HP_CPU_INT_FROM_CPU_2_REG (DR_REG_HP_SYS_BASE + 0x18)
/** HP_CPU_INT_FROM_CPU_2 : R/W; bitpos: [0]; default: 0;
 *  set 1 will triger a interrupt
 */
#define HP_CPU_INT_FROM_CPU_2    (BIT(0))
#define HP_CPU_INT_FROM_CPU_2_M  (HP_CPU_INT_FROM_CPU_2_V << HP_CPU_INT_FROM_CPU_2_S)
#define HP_CPU_INT_FROM_CPU_2_V  0x00000001U
#define HP_CPU_INT_FROM_CPU_2_S  0

/** HP_CPU_INT_FROM_CPU_3_REG register
 *  NA
 */
#define HP_CPU_INT_FROM_CPU_3_REG (DR_REG_HP_SYS_BASE + 0x1c)
/** HP_CPU_INT_FROM_CPU_3 : R/W; bitpos: [0]; default: 0;
 *  set 1 will triger a interrupt
 */
#define HP_CPU_INT_FROM_CPU_3    (BIT(0))
#define HP_CPU_INT_FROM_CPU_3_M  (HP_CPU_INT_FROM_CPU_3_V << HP_CPU_INT_FROM_CPU_3_S)
#define HP_CPU_INT_FROM_CPU_3_V  0x00000001U
#define HP_CPU_INT_FROM_CPU_3_S  0

/** HP_CACHE_CLK_CONFIG_REG register
 *  NA
 */
#define HP_CACHE_CLK_CONFIG_REG (DR_REG_HP_SYS_BASE + 0x20)
/** HP_REG_L2_CACHE_CLK_ON : R/W; bitpos: [0]; default: 1;
 *  l2 cahce clk enable
 */
#define HP_REG_L2_CACHE_CLK_ON    (BIT(0))
#define HP_REG_L2_CACHE_CLK_ON_M  (HP_REG_L2_CACHE_CLK_ON_V << HP_REG_L2_CACHE_CLK_ON_S)
#define HP_REG_L2_CACHE_CLK_ON_V  0x00000001U
#define HP_REG_L2_CACHE_CLK_ON_S  0
/** HP_REG_L1_D_CACHE_CLK_ON : R/W; bitpos: [1]; default: 1;
 *  l1 dcahce clk enable
 */
#define HP_REG_L1_D_CACHE_CLK_ON    (BIT(1))
#define HP_REG_L1_D_CACHE_CLK_ON_M  (HP_REG_L1_D_CACHE_CLK_ON_V << HP_REG_L1_D_CACHE_CLK_ON_S)
#define HP_REG_L1_D_CACHE_CLK_ON_V  0x00000001U
#define HP_REG_L1_D_CACHE_CLK_ON_S  1
/** HP_REG_L1_I1_CACHE_CLK_ON : R/W; bitpos: [4]; default: 1;
 *  l1 icahce1 clk enable
 */
#define HP_REG_L1_I1_CACHE_CLK_ON    (BIT(4))
#define HP_REG_L1_I1_CACHE_CLK_ON_M  (HP_REG_L1_I1_CACHE_CLK_ON_V << HP_REG_L1_I1_CACHE_CLK_ON_S)
#define HP_REG_L1_I1_CACHE_CLK_ON_V  0x00000001U
#define HP_REG_L1_I1_CACHE_CLK_ON_S  4
/** HP_REG_L1_I0_CACHE_CLK_ON : R/W; bitpos: [5]; default: 1;
 *  l1 icahce0 clk enable
 */
#define HP_REG_L1_I0_CACHE_CLK_ON    (BIT(5))
#define HP_REG_L1_I0_CACHE_CLK_ON_M  (HP_REG_L1_I0_CACHE_CLK_ON_V << HP_REG_L1_I0_CACHE_CLK_ON_S)
#define HP_REG_L1_I0_CACHE_CLK_ON_V  0x00000001U
#define HP_REG_L1_I0_CACHE_CLK_ON_S  5

/** HP_CACHE_RESET_CONFIG_REG register
 *  NA
 */
#define HP_CACHE_RESET_CONFIG_REG (DR_REG_HP_SYS_BASE + 0x24)
/** HP_REG_L1_D_CACHE_RESET : R/W; bitpos: [1]; default: 0;
 *  set 1 to reset l1 dcahce
 */
#define HP_REG_L1_D_CACHE_RESET    (BIT(1))
#define HP_REG_L1_D_CACHE_RESET_M  (HP_REG_L1_D_CACHE_RESET_V << HP_REG_L1_D_CACHE_RESET_S)
#define HP_REG_L1_D_CACHE_RESET_V  0x00000001U
#define HP_REG_L1_D_CACHE_RESET_S  1
/** HP_REG_L1_I1_CACHE_RESET : R/W; bitpos: [4]; default: 0;
 *  set 1 to reset l1 icahce1
 */
#define HP_REG_L1_I1_CACHE_RESET    (BIT(4))
#define HP_REG_L1_I1_CACHE_RESET_M  (HP_REG_L1_I1_CACHE_RESET_V << HP_REG_L1_I1_CACHE_RESET_S)
#define HP_REG_L1_I1_CACHE_RESET_V  0x00000001U
#define HP_REG_L1_I1_CACHE_RESET_S  4
/** HP_REG_L1_I0_CACHE_RESET : R/W; bitpos: [5]; default: 0;
 *  set 1 to reset l1 icahce0
 */
#define HP_REG_L1_I0_CACHE_RESET    (BIT(5))
#define HP_REG_L1_I0_CACHE_RESET_M  (HP_REG_L1_I0_CACHE_RESET_V << HP_REG_L1_I0_CACHE_RESET_S)
#define HP_REG_L1_I0_CACHE_RESET_V  0x00000001U
#define HP_REG_L1_I0_CACHE_RESET_S  5

/** HP_SYS_DMA_ADDR_CTRL_REG register
 *  NA
 */
#define HP_SYS_DMA_ADDR_CTRL_REG (DR_REG_HP_SYS_BASE + 0x2c)
/** HP_REG_SYS_DMA_ADDR_SEL : R/W; bitpos: [0]; default: 0;
 *  0 means dma access extmem use 8xxx_xxxx else use 4xxx_xxxx
 */
#define HP_REG_SYS_DMA_ADDR_SEL    (BIT(0))
#define HP_REG_SYS_DMA_ADDR_SEL_M  (HP_REG_SYS_DMA_ADDR_SEL_V << HP_REG_SYS_DMA_ADDR_SEL_S)
#define HP_REG_SYS_DMA_ADDR_SEL_V  0x00000001U
#define HP_REG_SYS_DMA_ADDR_SEL_S  0

/** HP_TCM_RAM_WRR_CONFIG_REG register
 *  NA
 */
#define HP_TCM_RAM_WRR_CONFIG_REG (DR_REG_HP_SYS_BASE + 0x34)
/** HP_REG_TCM_RAM_IBUS0_WT : R/W; bitpos: [2:0]; default: 7;
 *  weight value of ibus0
 */
#define HP_REG_TCM_RAM_IBUS0_WT    0x00000007U
#define HP_REG_TCM_RAM_IBUS0_WT_M  (HP_REG_TCM_RAM_IBUS0_WT_V << HP_REG_TCM_RAM_IBUS0_WT_S)
#define HP_REG_TCM_RAM_IBUS0_WT_V  0x00000007U
#define HP_REG_TCM_RAM_IBUS0_WT_S  0
/** HP_REG_TCM_RAM_IBUS1_WT : R/W; bitpos: [5:3]; default: 7;
 *  weight value of ibus1
 */
#define HP_REG_TCM_RAM_IBUS1_WT    0x00000007U
#define HP_REG_TCM_RAM_IBUS1_WT_M  (HP_REG_TCM_RAM_IBUS1_WT_V << HP_REG_TCM_RAM_IBUS1_WT_S)
#define HP_REG_TCM_RAM_IBUS1_WT_V  0x00000007U
#define HP_REG_TCM_RAM_IBUS1_WT_S  3
/** HP_REG_TCM_RAM_IBUS2_WT : R/W; bitpos: [8:6]; default: 4;
 *  weight value of ibus2
 */
#define HP_REG_TCM_RAM_IBUS2_WT    0x00000007U
#define HP_REG_TCM_RAM_IBUS2_WT_M  (HP_REG_TCM_RAM_IBUS2_WT_V << HP_REG_TCM_RAM_IBUS2_WT_S)
#define HP_REG_TCM_RAM_IBUS2_WT_V  0x00000007U
#define HP_REG_TCM_RAM_IBUS2_WT_S  6
/** HP_REG_TCM_RAM_IBUS3_WT : R/W; bitpos: [11:9]; default: 4;
 *  weight value of ibus3
 */
#define HP_REG_TCM_RAM_IBUS3_WT    0x00000007U
#define HP_REG_TCM_RAM_IBUS3_WT_M  (HP_REG_TCM_RAM_IBUS3_WT_V << HP_REG_TCM_RAM_IBUS3_WT_S)
#define HP_REG_TCM_RAM_IBUS3_WT_V  0x00000007U
#define HP_REG_TCM_RAM_IBUS3_WT_S  9
/** HP_REG_TCM_RAM_DBUS0_WT : R/W; bitpos: [14:12]; default: 5;
 *  weight value of dbus0
 */
#define HP_REG_TCM_RAM_DBUS0_WT    0x00000007U
#define HP_REG_TCM_RAM_DBUS0_WT_M  (HP_REG_TCM_RAM_DBUS0_WT_V << HP_REG_TCM_RAM_DBUS0_WT_S)
#define HP_REG_TCM_RAM_DBUS0_WT_V  0x00000007U
#define HP_REG_TCM_RAM_DBUS0_WT_S  12
/** HP_REG_TCM_RAM_DBUS1_WT : R/W; bitpos: [17:15]; default: 5;
 *  weight value of dbus1
 */
#define HP_REG_TCM_RAM_DBUS1_WT    0x00000007U
#define HP_REG_TCM_RAM_DBUS1_WT_M  (HP_REG_TCM_RAM_DBUS1_WT_V << HP_REG_TCM_RAM_DBUS1_WT_S)
#define HP_REG_TCM_RAM_DBUS1_WT_V  0x00000007U
#define HP_REG_TCM_RAM_DBUS1_WT_S  15
/** HP_REG_TCM_RAM_DBUS2_WT : R/W; bitpos: [20:18]; default: 3;
 *  weight value of dbus2
 */
#define HP_REG_TCM_RAM_DBUS2_WT    0x00000007U
#define HP_REG_TCM_RAM_DBUS2_WT_M  (HP_REG_TCM_RAM_DBUS2_WT_V << HP_REG_TCM_RAM_DBUS2_WT_S)
#define HP_REG_TCM_RAM_DBUS2_WT_V  0x00000007U
#define HP_REG_TCM_RAM_DBUS2_WT_S  18
/** HP_REG_TCM_RAM_DBUS3_WT : R/W; bitpos: [23:21]; default: 3;
 *  weight value of dbus3
 */
#define HP_REG_TCM_RAM_DBUS3_WT    0x00000007U
#define HP_REG_TCM_RAM_DBUS3_WT_M  (HP_REG_TCM_RAM_DBUS3_WT_V << HP_REG_TCM_RAM_DBUS3_WT_S)
#define HP_REG_TCM_RAM_DBUS3_WT_V  0x00000007U
#define HP_REG_TCM_RAM_DBUS3_WT_S  21
/** HP_REG_TCM_RAM_DMA_WT : R/W; bitpos: [26:24]; default: 2;
 *  weight value of dma
 */
#define HP_REG_TCM_RAM_DMA_WT    0x00000007U
#define HP_REG_TCM_RAM_DMA_WT_M  (HP_REG_TCM_RAM_DMA_WT_V << HP_REG_TCM_RAM_DMA_WT_S)
#define HP_REG_TCM_RAM_DMA_WT_V  0x00000007U
#define HP_REG_TCM_RAM_DMA_WT_S  24
/** HP_REG_TCM_RAM_WRR_HIGH : R/W; bitpos: [31]; default: 1;
 *  enable weighted round robin arbitration
 */
#define HP_REG_TCM_RAM_WRR_HIGH    (BIT(31))
#define HP_REG_TCM_RAM_WRR_HIGH_M  (HP_REG_TCM_RAM_WRR_HIGH_V << HP_REG_TCM_RAM_WRR_HIGH_S)
#define HP_REG_TCM_RAM_WRR_HIGH_V  0x00000001U
#define HP_REG_TCM_RAM_WRR_HIGH_S  31

/** HP_TCM_SW_PARITY_BWE_MASK_REG register
 *  NA
 */
#define HP_TCM_SW_PARITY_BWE_MASK_REG (DR_REG_HP_SYS_BASE + 0x38)
/** HP_REG_TCM_SW_PARITY_BWE_MASK_CTRL : R/W; bitpos: [0]; default: 0;
 *  Set 1 to mask tcm bwe parity code bit
 */
#define HP_REG_TCM_SW_PARITY_BWE_MASK_CTRL    (BIT(0))
#define HP_REG_TCM_SW_PARITY_BWE_MASK_CTRL_M  (HP_REG_TCM_SW_PARITY_BWE_MASK_CTRL_V << HP_REG_TCM_SW_PARITY_BWE_MASK_CTRL_S)
#define HP_REG_TCM_SW_PARITY_BWE_MASK_CTRL_V  0x00000001U
#define HP_REG_TCM_SW_PARITY_BWE_MASK_CTRL_S  0

/** HP_TCM_RAM_PWR_CTRL0_REG register
 *  NA
 */
#define HP_TCM_RAM_PWR_CTRL0_REG (DR_REG_HP_SYS_BASE + 0x3c)
/** HP_REG_HP_TCM_CLK_FORCE_ON : R/W; bitpos: [0]; default: 0;
 *  hp_tcm clk gatig force on
 */
#define HP_REG_HP_TCM_CLK_FORCE_ON    (BIT(0))
#define HP_REG_HP_TCM_CLK_FORCE_ON_M  (HP_REG_HP_TCM_CLK_FORCE_ON_V << HP_REG_HP_TCM_CLK_FORCE_ON_S)
#define HP_REG_HP_TCM_CLK_FORCE_ON_V  0x00000001U
#define HP_REG_HP_TCM_CLK_FORCE_ON_S  0

/** HP_L2_ROM_PWR_CTRL0_REG register
 *  NA
 */
#define HP_L2_ROM_PWR_CTRL0_REG (DR_REG_HP_SYS_BASE + 0x40)
/** HP_REG_L2_ROM_CLK_FORCE_ON : R/W; bitpos: [0]; default: 0;
 *  l2_rom clk gating force on
 */
#define HP_REG_L2_ROM_CLK_FORCE_ON    (BIT(0))
#define HP_REG_L2_ROM_CLK_FORCE_ON_M  (HP_REG_L2_ROM_CLK_FORCE_ON_V << HP_REG_L2_ROM_CLK_FORCE_ON_S)
#define HP_REG_L2_ROM_CLK_FORCE_ON_V  0x00000001U
#define HP_REG_L2_ROM_CLK_FORCE_ON_S  0

