espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_reg.h
/** HP_PROBEA_CTRL_REG register
 *  NA
 */
#define HP_PROBEA_CTRL_REG (DR_REG_HP_SYS_BASE + 0x50)
/** HP_REG_PROBE_A_MOD_SEL : R/W; bitpos: [15:0]; default: 0;
 *  Tihs field is used to selec probe_group from probe_group0 to probe_group15 for
 *  module's probe_out[31:0] in a mode
 */
#define HP_REG_PROBE_A_MOD_SEL    0x0000FFFFU
#define HP_REG_PROBE_A_MOD_SEL_M  (HP_REG_PROBE_A_MOD_SEL_V << HP_REG_PROBE_A_MOD_SEL_S)
#define HP_REG_PROBE_A_MOD_SEL_V  0x0000FFFFU
#define HP_REG_PROBE_A_MOD_SEL_S  0
/** HP_REG_PROBE_A_TOP_SEL : R/W; bitpos: [23:16]; default: 0;
 *  Tihs field is used to selec module's probe_out[31:0] as probe out in a mode
 */
#define HP_REG_PROBE_A_TOP_SEL    0x000000FFU
#define HP_REG_PROBE_A_TOP_SEL_M  (HP_REG_PROBE_A_TOP_SEL_V << HP_REG_PROBE_A_TOP_SEL_S)
#define HP_REG_PROBE_A_TOP_SEL_V  0x000000FFU
#define HP_REG_PROBE_A_TOP_SEL_S  16
/** HP_REG_PROBE_L_SEL : R/W; bitpos: [25:24]; default: 0;
 *  Tihs field is used to selec probe_out[31:16]
 */
#define HP_REG_PROBE_L_SEL    0x00000003U
#define HP_REG_PROBE_L_SEL_M  (HP_REG_PROBE_L_SEL_V << HP_REG_PROBE_L_SEL_S)
#define HP_REG_PROBE_L_SEL_V  0x00000003U
#define HP_REG_PROBE_L_SEL_S  24
/** HP_REG_PROBE_H_SEL : R/W; bitpos: [27:26]; default: 0;
 *  Tihs field is used to selec probe_out[31:16]
 */
#define HP_REG_PROBE_H_SEL    0x00000003U
#define HP_REG_PROBE_H_SEL_M  (HP_REG_PROBE_H_SEL_V << HP_REG_PROBE_H_SEL_S)
#define HP_REG_PROBE_H_SEL_V  0x00000003U
#define HP_REG_PROBE_H_SEL_S  26
/** HP_REG_PROBE_GLOBAL_EN : R/W; bitpos: [28]; default: 0;
 *  Set this bit to enable global debug probe in hp system.
 */
#define HP_REG_PROBE_GLOBAL_EN    (BIT(28))
#define HP_REG_PROBE_GLOBAL_EN_M  (HP_REG_PROBE_GLOBAL_EN_V << HP_REG_PROBE_GLOBAL_EN_S)
#define HP_REG_PROBE_GLOBAL_EN_V  0x00000001U
#define HP_REG_PROBE_GLOBAL_EN_S  28

/** HP_PROBEB_CTRL_REG register
 *  NA
 */
#define HP_PROBEB_CTRL_REG (DR_REG_HP_SYS_BASE + 0x54)
/** HP_REG_PROBE_B_MOD_SEL : R/W; bitpos: [15:0]; default: 0;
 *  Tihs field is used to selec probe_group from probe_group0 to probe_group15 for
 *  module's probe_out[31:0] in b mode.
 */
#define HP_REG_PROBE_B_MOD_SEL    0x0000FFFFU
#define HP_REG_PROBE_B_MOD_SEL_M  (HP_REG_PROBE_B_MOD_SEL_V << HP_REG_PROBE_B_MOD_SEL_S)
#define HP_REG_PROBE_B_MOD_SEL_V  0x0000FFFFU
#define HP_REG_PROBE_B_MOD_SEL_S  0
/** HP_REG_PROBE_B_TOP_SEL : R/W; bitpos: [23:16]; default: 0;
 *  Tihs field is used to select module's probe_out[31:0]  as probe_out in b mode
 */
#define HP_REG_PROBE_B_TOP_SEL    0x000000FFU
#define HP_REG_PROBE_B_TOP_SEL_M  (HP_REG_PROBE_B_TOP_SEL_V << HP_REG_PROBE_B_TOP_SEL_S)
#define HP_REG_PROBE_B_TOP_SEL_V  0x000000FFU
#define HP_REG_PROBE_B_TOP_SEL_S  16
/** HP_REG_PROBE_B_EN : R/W; bitpos: [24]; default: 0;
 *  Set this bit to enable b mode for debug probe. 1:  b mode, 0: a mode.
 */
#define HP_REG_PROBE_B_EN    (BIT(24))
#define HP_REG_PROBE_B_EN_M  (HP_REG_PROBE_B_EN_V << HP_REG_PROBE_B_EN_S)
#define HP_REG_PROBE_B_EN_V  0x00000001U
#define HP_REG_PROBE_B_EN_S  24

/** HP_PROBE_OUT_REG register
 *  NA
 */
#define HP_PROBE_OUT_REG (DR_REG_HP_SYS_BASE + 0x5c)
/** HP_REG_PROBE_TOP_OUT : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define HP_REG_PROBE_TOP_OUT    0xFFFFFFFFU
#define HP_REG_PROBE_TOP_OUT_M  (HP_REG_PROBE_TOP_OUT_V << HP_REG_PROBE_TOP_OUT_S)
#define HP_REG_PROBE_TOP_OUT_V  0xFFFFFFFFU
#define HP_REG_PROBE_TOP_OUT_S  0

/** HP_L2_MEM_RAM_PWR_CTRL0_REG register
 *  NA
 */
#define HP_L2_MEM_RAM_PWR_CTRL0_REG (DR_REG_HP_SYS_BASE + 0x60)
/** HP_REG_L2_MEM_CLK_FORCE_ON : R/W; bitpos: [0]; default: 0;
 *  l2ram clk_gating force on
 */
#define HP_REG_L2_MEM_CLK_FORCE_ON    (BIT(0))
#define HP_REG_L2_MEM_CLK_FORCE_ON_M  (HP_REG_L2_MEM_CLK_FORCE_ON_V << HP_REG_L2_MEM_CLK_FORCE_ON_S)
#define HP_REG_L2_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_REG_L2_MEM_CLK_FORCE_ON_S  0

/** HP_CPU_CORESTALLED_ST_REG register
 *  NA
 */
#define HP_CPU_CORESTALLED_ST_REG (DR_REG_HP_SYS_BASE + 0x64)
/** HP_REG_CORE0_CORESTALLED_ST : RO; bitpos: [0]; default: 0;
 *  hp core0 corestalled status
 */
#define HP_REG_CORE0_CORESTALLED_ST    (BIT(0))
#define HP_REG_CORE0_CORESTALLED_ST_M  (HP_REG_CORE0_CORESTALLED_ST_V << HP_REG_CORE0_CORESTALLED_ST_S)
#define HP_REG_CORE0_CORESTALLED_ST_V  0x00000001U
#define HP_REG_CORE0_CORESTALLED_ST_S  0
/** HP_REG_CORE1_CORESTALLED_ST : RO; bitpos: [1]; default: 0;
 *  hp core1 corestalled status
 */
#define HP_REG_CORE1_CORESTALLED_ST    (BIT(1))
#define HP_REG_CORE1_CORESTALLED_ST_M  (HP_REG_CORE1_CORESTALLED_ST_V << HP_REG_CORE1_CORESTALLED_ST_S)
#define HP_REG_CORE1_CORESTALLED_ST_V  0x00000001U
#define HP_REG_CORE1_CORESTALLED_ST_S  1

/** HP_CRYPTO_CTRL_REG register
 *  NA
 */
#define HP_CRYPTO_CTRL_REG (DR_REG_HP_SYS_BASE + 0x70)
/** HP_REG_ENABLE_SPI_MANUAL_ENCRYPT : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define HP_REG_ENABLE_SPI_MANUAL_ENCRYPT    (BIT(0))
#define HP_REG_ENABLE_SPI_MANUAL_ENCRYPT_M  (HP_REG_ENABLE_SPI_MANUAL_ENCRYPT_V << HP_REG_ENABLE_SPI_MANUAL_ENCRYPT_S)
#define HP_REG_ENABLE_SPI_MANUAL_ENCRYPT_V  0x00000001U
#define HP_REG_ENABLE_SPI_MANUAL_ENCRYPT_S  0
/** HP_REG_ENABLE_DOWNLOAD_DB_ENCRYPT : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define HP_REG_ENABLE_DOWNLOAD_DB_ENCRYPT    (BIT(1))
#define HP_REG_ENABLE_DOWNLOAD_DB_ENCRYPT_M  (HP_REG_ENABLE_DOWNLOAD_DB_ENCRYPT_V << HP_REG_ENABLE_DOWNLOAD_DB_ENCRYPT_S)
#define HP_REG_ENABLE_DOWNLOAD_DB_ENCRYPT_V  0x00000001U
#define HP_REG_ENABLE_DOWNLOAD_DB_ENCRYPT_S  1
/** HP_REG_ENABLE_DOWNLOAD_G0CB_DECRYPT : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define HP_REG_ENABLE_DOWNLOAD_G0CB_DECRYPT    (BIT(2))
#define HP_REG_ENABLE_DOWNLOAD_G0CB_DECRYPT_M  (HP_REG_ENABLE_DOWNLOAD_G0CB_DECRYPT_V << HP_REG_ENABLE_DOWNLOAD_G0CB_DECRYPT_S)
#define HP_REG_ENABLE_DOWNLOAD_G0CB_DECRYPT_V  0x00000001U
#define HP_REG_ENABLE_DOWNLOAD_G0CB_DECRYPT_S  2
/** HP_REG_ENABLE_DOWNLOAD_MANUAL_ENCRYPT : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define HP_REG_ENABLE_DOWNLOAD_MANUAL_ENCRYPT    (BIT(3))
#define HP_REG_ENABLE_DOWNLOAD_MANUAL_ENCRYPT_M  (HP_REG_ENABLE_DOWNLOAD_MANUAL_ENCRYPT_V << HP_REG_ENABLE_DOWNLOAD_MANUAL_ENCRYPT_S)
#define HP_REG_ENABLE_DOWNLOAD_MANUAL_ENCRYPT_V  0x00000001U
#define HP_REG_ENABLE_DOWNLOAD_MANUAL_ENCRYPT_S  3

