espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_reg.h
/** HP_GPIO_O_HOLD_CTRL0_REG register
 *  NA
 */
#define HP_GPIO_O_HOLD_CTRL0_REG (DR_REG_HP_SYS_BASE + 0x74)
/** HP_REG_GPIO_0_HOLD_LOW : R/W; bitpos: [31:0]; default: 0;
 *  hold control for gpio47~16
 */
#define HP_REG_GPIO_0_HOLD_LOW    0xFFFFFFFFU
#define HP_REG_GPIO_0_HOLD_LOW_M  (HP_REG_GPIO_0_HOLD_LOW_V << HP_REG_GPIO_0_HOLD_LOW_S)
#define HP_REG_GPIO_0_HOLD_LOW_V  0xFFFFFFFFU
#define HP_REG_GPIO_0_HOLD_LOW_S  0

/** HP_GPIO_O_HOLD_CTRL1_REG register
 *  NA
 */
#define HP_GPIO_O_HOLD_CTRL1_REG (DR_REG_HP_SYS_BASE + 0x78)
/** HP_REG_GPIO_0_HOLD_HIGH : R/W; bitpos: [8:0]; default: 0;
 *  hold control for gpio56~48
 */
#define HP_REG_GPIO_0_HOLD_HIGH    0x000001FFU
#define HP_REG_GPIO_0_HOLD_HIGH_M  (HP_REG_GPIO_0_HOLD_HIGH_V << HP_REG_GPIO_0_HOLD_HIGH_S)
#define HP_REG_GPIO_0_HOLD_HIGH_V  0x000001FFU
#define HP_REG_GPIO_0_HOLD_HIGH_S  0

/** HP_SYS_RDN_ECO_CS_REG register
 *  NA
 */
#define HP_SYS_RDN_ECO_CS_REG (DR_REG_HP_SYS_BASE + 0x7c)
/** HP_REG_HP_SYS_RDN_ECO_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define HP_REG_HP_SYS_RDN_ECO_EN    (BIT(0))
#define HP_REG_HP_SYS_RDN_ECO_EN_M  (HP_REG_HP_SYS_RDN_ECO_EN_V << HP_REG_HP_SYS_RDN_ECO_EN_S)
#define HP_REG_HP_SYS_RDN_ECO_EN_V  0x00000001U
#define HP_REG_HP_SYS_RDN_ECO_EN_S  0
/** HP_REG_HP_SYS_RDN_ECO_RESULT : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define HP_REG_HP_SYS_RDN_ECO_RESULT    (BIT(1))
#define HP_REG_HP_SYS_RDN_ECO_RESULT_M  (HP_REG_HP_SYS_RDN_ECO_RESULT_V << HP_REG_HP_SYS_RDN_ECO_RESULT_S)
#define HP_REG_HP_SYS_RDN_ECO_RESULT_V  0x00000001U
#define HP_REG_HP_SYS_RDN_ECO_RESULT_S  1

/** HP_CACHE_APB_POSTW_EN_REG register
 *  NA
 */
#define HP_CACHE_APB_POSTW_EN_REG (DR_REG_HP_SYS_BASE + 0x80)
/** HP_REG_CACHE_APB_POSTW_EN : R/W; bitpos: [0]; default: 0;
 *  cache apb register interface post write enable, 1 will speed up write, but will
 *  take some time to update value to register
 */
#define HP_REG_CACHE_APB_POSTW_EN    (BIT(0))
#define HP_REG_CACHE_APB_POSTW_EN_M  (HP_REG_CACHE_APB_POSTW_EN_V << HP_REG_CACHE_APB_POSTW_EN_S)
#define HP_REG_CACHE_APB_POSTW_EN_V  0x00000001U
#define HP_REG_CACHE_APB_POSTW_EN_S  0

/** HP_L2_MEM_SUBSIZE_REG register
 *  NA
 */
#define HP_L2_MEM_SUBSIZE_REG (DR_REG_HP_SYS_BASE + 0x84)
/** HP_REG_L2_MEM_SUB_BLKSIZE : R/W; bitpos: [1:0]; default: 0;
 *  l2mem sub block size 00=>32 01=>64 10=>128 11=>256
 */
#define HP_REG_L2_MEM_SUB_BLKSIZE    0x00000003U
#define HP_REG_L2_MEM_SUB_BLKSIZE_M  (HP_REG_L2_MEM_SUB_BLKSIZE_V << HP_REG_L2_MEM_SUB_BLKSIZE_S)
#define HP_REG_L2_MEM_SUB_BLKSIZE_V  0x00000003U
#define HP_REG_L2_MEM_SUB_BLKSIZE_S  0

/** HP_L2_MEM_INT_RAW_REG register
 *  NA
 */
#define HP_L2_MEM_INT_RAW_REG (DR_REG_HP_SYS_BASE + 0x9c)
/** HP_REG_L2_MEM_ECC_ERR_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  intr triggered when two bit error detected and corrected from ecc
 */
#define HP_REG_L2_MEM_ECC_ERR_INT_RAW    (BIT(0))
#define HP_REG_L2_MEM_ECC_ERR_INT_RAW_M  (HP_REG_L2_MEM_ECC_ERR_INT_RAW_V << HP_REG_L2_MEM_ECC_ERR_INT_RAW_S)
#define HP_REG_L2_MEM_ECC_ERR_INT_RAW_V  0x00000001U
#define HP_REG_L2_MEM_ECC_ERR_INT_RAW_S  0
/** HP_REG_L2_MEM_EXCEED_ADDR_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  intr triggered when access addr exceeds 0xff9ffff at bypass mode or exceeds
 *  0xff80000 at l2cache 128kb mode or exceeds 0xff60000 at l2cache 256kb mode
 */
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_RAW    (BIT(1))
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_RAW_M  (HP_REG_L2_MEM_EXCEED_ADDR_INT_RAW_V << HP_REG_L2_MEM_EXCEED_ADDR_INT_RAW_S)
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_RAW_V  0x00000001U
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_RAW_S  1
/** HP_REG_L2_MEM_ERR_RESP_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  intr triggered when err response occurs
 */
#define HP_REG_L2_MEM_ERR_RESP_INT_RAW    (BIT(2))
#define HP_REG_L2_MEM_ERR_RESP_INT_RAW_M  (HP_REG_L2_MEM_ERR_RESP_INT_RAW_V << HP_REG_L2_MEM_ERR_RESP_INT_RAW_S)
#define HP_REG_L2_MEM_ERR_RESP_INT_RAW_V  0x00000001U
#define HP_REG_L2_MEM_ERR_RESP_INT_RAW_S  2

/** HP_L2_MEM_INT_ST_REG register
 *  NA
 */
#define HP_L2_MEM_INT_ST_REG (DR_REG_HP_SYS_BASE + 0xa0)
/** HP_REG_L2_MEM_ECC_ERR_INT_ST : RO; bitpos: [0]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_ECC_ERR_INT_ST    (BIT(0))
#define HP_REG_L2_MEM_ECC_ERR_INT_ST_M  (HP_REG_L2_MEM_ECC_ERR_INT_ST_V << HP_REG_L2_MEM_ECC_ERR_INT_ST_S)
#define HP_REG_L2_MEM_ECC_ERR_INT_ST_V  0x00000001U
#define HP_REG_L2_MEM_ECC_ERR_INT_ST_S  0
/** HP_REG_L2_MEM_EXCEED_ADDR_INT_ST : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_ST    (BIT(1))
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_ST_M  (HP_REG_L2_MEM_EXCEED_ADDR_INT_ST_V << HP_REG_L2_MEM_EXCEED_ADDR_INT_ST_S)
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_ST_V  0x00000001U
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_ST_S  1
/** HP_REG_L2_MEM_ERR_RESP_INT_ST : RO; bitpos: [2]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_ERR_RESP_INT_ST    (BIT(2))
#define HP_REG_L2_MEM_ERR_RESP_INT_ST_M  (HP_REG_L2_MEM_ERR_RESP_INT_ST_V << HP_REG_L2_MEM_ERR_RESP_INT_ST_S)
#define HP_REG_L2_MEM_ERR_RESP_INT_ST_V  0x00000001U
#define HP_REG_L2_MEM_ERR_RESP_INT_ST_S  2

/** HP_L2_MEM_INT_ENA_REG register
 *  NA
 */
#define HP_L2_MEM_INT_ENA_REG (DR_REG_HP_SYS_BASE + 0xa4)
/** HP_REG_L2_MEM_ECC_ERR_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_ECC_ERR_INT_ENA    (BIT(0))
#define HP_REG_L2_MEM_ECC_ERR_INT_ENA_M  (HP_REG_L2_MEM_ECC_ERR_INT_ENA_V << HP_REG_L2_MEM_ECC_ERR_INT_ENA_S)
#define HP_REG_L2_MEM_ECC_ERR_INT_ENA_V  0x00000001U
#define HP_REG_L2_MEM_ECC_ERR_INT_ENA_S  0
/** HP_REG_L2_MEM_EXCEED_ADDR_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_ENA    (BIT(1))
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_ENA_M  (HP_REG_L2_MEM_EXCEED_ADDR_INT_ENA_V << HP_REG_L2_MEM_EXCEED_ADDR_INT_ENA_S)
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_ENA_V  0x00000001U
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_ENA_S  1
/** HP_REG_L2_MEM_ERR_RESP_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_ERR_RESP_INT_ENA    (BIT(2))
#define HP_REG_L2_MEM_ERR_RESP_INT_ENA_M  (HP_REG_L2_MEM_ERR_RESP_INT_ENA_V << HP_REG_L2_MEM_ERR_RESP_INT_ENA_S)
#define HP_REG_L2_MEM_ERR_RESP_INT_ENA_V  0x00000001U
#define HP_REG_L2_MEM_ERR_RESP_INT_ENA_S  2

