espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_reg.h
/** HP_L2_MEM_INT_CLR_REG register
 *  NA
 */
#define HP_L2_MEM_INT_CLR_REG (DR_REG_HP_SYS_BASE + 0xa8)
/** HP_REG_L2_MEM_ECC_ERR_INT_CLR : WT; bitpos: [0]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_ECC_ERR_INT_CLR    (BIT(0))
#define HP_REG_L2_MEM_ECC_ERR_INT_CLR_M  (HP_REG_L2_MEM_ECC_ERR_INT_CLR_V << HP_REG_L2_MEM_ECC_ERR_INT_CLR_S)
#define HP_REG_L2_MEM_ECC_ERR_INT_CLR_V  0x00000001U
#define HP_REG_L2_MEM_ECC_ERR_INT_CLR_S  0
/** HP_REG_L2_MEM_EXCEED_ADDR_INT_CLR : WT; bitpos: [1]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_CLR    (BIT(1))
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_CLR_M  (HP_REG_L2_MEM_EXCEED_ADDR_INT_CLR_V << HP_REG_L2_MEM_EXCEED_ADDR_INT_CLR_S)
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_CLR_V  0x00000001U
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_CLR_S  1
/** HP_REG_L2_MEM_ERR_RESP_INT_CLR : WT; bitpos: [2]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_ERR_RESP_INT_CLR    (BIT(2))
#define HP_REG_L2_MEM_ERR_RESP_INT_CLR_M  (HP_REG_L2_MEM_ERR_RESP_INT_CLR_V << HP_REG_L2_MEM_ERR_RESP_INT_CLR_S)
#define HP_REG_L2_MEM_ERR_RESP_INT_CLR_V  0x00000001U
#define HP_REG_L2_MEM_ERR_RESP_INT_CLR_S  2

/** HP_L2_MEM_L2_RAM_ECC_REG register
 *  NA
 */
#define HP_L2_MEM_L2_RAM_ECC_REG (DR_REG_HP_SYS_BASE + 0xac)
/** HP_REG_L2_RAM_UNIT0_ECC_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define HP_REG_L2_RAM_UNIT0_ECC_EN    (BIT(0))
#define HP_REG_L2_RAM_UNIT0_ECC_EN_M  (HP_REG_L2_RAM_UNIT0_ECC_EN_V << HP_REG_L2_RAM_UNIT0_ECC_EN_S)
#define HP_REG_L2_RAM_UNIT0_ECC_EN_V  0x00000001U
#define HP_REG_L2_RAM_UNIT0_ECC_EN_S  0
/** HP_REG_L2_RAM_UNIT1_ECC_EN : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define HP_REG_L2_RAM_UNIT1_ECC_EN    (BIT(1))
#define HP_REG_L2_RAM_UNIT1_ECC_EN_M  (HP_REG_L2_RAM_UNIT1_ECC_EN_V << HP_REG_L2_RAM_UNIT1_ECC_EN_S)
#define HP_REG_L2_RAM_UNIT1_ECC_EN_V  0x00000001U
#define HP_REG_L2_RAM_UNIT1_ECC_EN_S  1
/** HP_REG_L2_RAM_UNIT2_ECC_EN : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define HP_REG_L2_RAM_UNIT2_ECC_EN    (BIT(2))
#define HP_REG_L2_RAM_UNIT2_ECC_EN_M  (HP_REG_L2_RAM_UNIT2_ECC_EN_V << HP_REG_L2_RAM_UNIT2_ECC_EN_S)
#define HP_REG_L2_RAM_UNIT2_ECC_EN_V  0x00000001U
#define HP_REG_L2_RAM_UNIT2_ECC_EN_S  2
/** HP_REG_L2_RAM_UNIT3_ECC_EN : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define HP_REG_L2_RAM_UNIT3_ECC_EN    (BIT(3))
#define HP_REG_L2_RAM_UNIT3_ECC_EN_M  (HP_REG_L2_RAM_UNIT3_ECC_EN_V << HP_REG_L2_RAM_UNIT3_ECC_EN_S)
#define HP_REG_L2_RAM_UNIT3_ECC_EN_V  0x00000001U
#define HP_REG_L2_RAM_UNIT3_ECC_EN_S  3
/** HP_REG_L2_RAM_UNIT4_ECC_EN : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define HP_REG_L2_RAM_UNIT4_ECC_EN    (BIT(4))
#define HP_REG_L2_RAM_UNIT4_ECC_EN_M  (HP_REG_L2_RAM_UNIT4_ECC_EN_V << HP_REG_L2_RAM_UNIT4_ECC_EN_S)
#define HP_REG_L2_RAM_UNIT4_ECC_EN_V  0x00000001U
#define HP_REG_L2_RAM_UNIT4_ECC_EN_S  4
/** HP_REG_L2_RAM_UNIT5_ECC_EN : R/W; bitpos: [5]; default: 0;
 *  NA
 */
#define HP_REG_L2_RAM_UNIT5_ECC_EN    (BIT(5))
#define HP_REG_L2_RAM_UNIT5_ECC_EN_M  (HP_REG_L2_RAM_UNIT5_ECC_EN_V << HP_REG_L2_RAM_UNIT5_ECC_EN_S)
#define HP_REG_L2_RAM_UNIT5_ECC_EN_V  0x00000001U
#define HP_REG_L2_RAM_UNIT5_ECC_EN_S  5

/** HP_L2_MEM_INT_RECORD0_REG register
 *  NA
 */
#define HP_L2_MEM_INT_RECORD0_REG (DR_REG_HP_SYS_BASE + 0xb0)
/** HP_REG_L2_MEM_EXCEED_ADDR_INT_ADDR : RO; bitpos: [20:0]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_ADDR    0x001FFFFFU
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_ADDR_M  (HP_REG_L2_MEM_EXCEED_ADDR_INT_ADDR_V << HP_REG_L2_MEM_EXCEED_ADDR_INT_ADDR_S)
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_ADDR_V  0x001FFFFFU
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_ADDR_S  0
/** HP_REG_L2_MEM_EXCEED_ADDR_INT_WE : RO; bitpos: [21]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_WE    (BIT(21))
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_WE_M  (HP_REG_L2_MEM_EXCEED_ADDR_INT_WE_V << HP_REG_L2_MEM_EXCEED_ADDR_INT_WE_S)
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_WE_V  0x00000001U
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_WE_S  21
/** HP_REG_L2_MEM_EXCEED_ADDR_INT_MASTER : RO; bitpos: [24:22]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_MASTER    0x00000007U
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_MASTER_M  (HP_REG_L2_MEM_EXCEED_ADDR_INT_MASTER_V << HP_REG_L2_MEM_EXCEED_ADDR_INT_MASTER_S)
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_MASTER_V  0x00000007U
#define HP_REG_L2_MEM_EXCEED_ADDR_INT_MASTER_S  22

/** HP_L2_MEM_INT_RECORD1_REG register
 *  NA
 */
#define HP_L2_MEM_INT_RECORD1_REG (DR_REG_HP_SYS_BASE + 0xb4)
/** HP_REG_L2_MEM_ECC_ERR_INT_ADDR : RO; bitpos: [14:0]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_ECC_ERR_INT_ADDR    0x00007FFFU
#define HP_REG_L2_MEM_ECC_ERR_INT_ADDR_M  (HP_REG_L2_MEM_ECC_ERR_INT_ADDR_V << HP_REG_L2_MEM_ECC_ERR_INT_ADDR_S)
#define HP_REG_L2_MEM_ECC_ERR_INT_ADDR_V  0x00007FFFU
#define HP_REG_L2_MEM_ECC_ERR_INT_ADDR_S  0
/** HP_REG_L2_MEM_ECC_ONE_BIT_ERR : RO; bitpos: [15]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_ECC_ONE_BIT_ERR    (BIT(15))
#define HP_REG_L2_MEM_ECC_ONE_BIT_ERR_M  (HP_REG_L2_MEM_ECC_ONE_BIT_ERR_V << HP_REG_L2_MEM_ECC_ONE_BIT_ERR_S)
#define HP_REG_L2_MEM_ECC_ONE_BIT_ERR_V  0x00000001U
#define HP_REG_L2_MEM_ECC_ONE_BIT_ERR_S  15
/** HP_REG_L2_MEM_ECC_TWO_BIT_ERR : RO; bitpos: [16]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_ECC_TWO_BIT_ERR    (BIT(16))
#define HP_REG_L2_MEM_ECC_TWO_BIT_ERR_M  (HP_REG_L2_MEM_ECC_TWO_BIT_ERR_V << HP_REG_L2_MEM_ECC_TWO_BIT_ERR_S)
#define HP_REG_L2_MEM_ECC_TWO_BIT_ERR_V  0x00000001U
#define HP_REG_L2_MEM_ECC_TWO_BIT_ERR_S  16
/** HP_REG_L2_MEM_ECC_ERR_BIT : RO; bitpos: [25:17]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_ECC_ERR_BIT    0x000001FFU
#define HP_REG_L2_MEM_ECC_ERR_BIT_M  (HP_REG_L2_MEM_ECC_ERR_BIT_V << HP_REG_L2_MEM_ECC_ERR_BIT_S)
#define HP_REG_L2_MEM_ECC_ERR_BIT_V  0x000001FFU
#define HP_REG_L2_MEM_ECC_ERR_BIT_S  17
/** HP_REG_L2_CACHE_ERR_BANK : RO; bitpos: [26]; default: 0;
 *  NA
 */
#define HP_REG_L2_CACHE_ERR_BANK    (BIT(26))
#define HP_REG_L2_CACHE_ERR_BANK_M  (HP_REG_L2_CACHE_ERR_BANK_V << HP_REG_L2_CACHE_ERR_BANK_S)
#define HP_REG_L2_CACHE_ERR_BANK_V  0x00000001U
#define HP_REG_L2_CACHE_ERR_BANK_S  26

