espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_reg.h
/** HP_L2_MEM_L2_CACHE_ECC_REG register
 *  NA
 */
#define HP_L2_MEM_L2_CACHE_ECC_REG (DR_REG_HP_SYS_BASE + 0xc4)
/** HP_REG_L2_CACHE_ECC_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define HP_REG_L2_CACHE_ECC_EN    (BIT(0))
#define HP_REG_L2_CACHE_ECC_EN_M  (HP_REG_L2_CACHE_ECC_EN_V << HP_REG_L2_CACHE_ECC_EN_S)
#define HP_REG_L2_CACHE_ECC_EN_V  0x00000001U
#define HP_REG_L2_CACHE_ECC_EN_S  0

/** HP_L1CACHE_BUS0_ID_REG register
 *  NA
 */
#define HP_L1CACHE_BUS0_ID_REG (DR_REG_HP_SYS_BASE + 0xc8)
/** HP_REG_L1_CACHE_BUS0_ID : R/W; bitpos: [3:0]; default: 0;
 *  NA
 */
#define HP_REG_L1_CACHE_BUS0_ID    0x0000000FU
#define HP_REG_L1_CACHE_BUS0_ID_M  (HP_REG_L1_CACHE_BUS0_ID_V << HP_REG_L1_CACHE_BUS0_ID_S)
#define HP_REG_L1_CACHE_BUS0_ID_V  0x0000000FU
#define HP_REG_L1_CACHE_BUS0_ID_S  0

/** HP_L1CACHE_BUS1_ID_REG register
 *  NA
 */
#define HP_L1CACHE_BUS1_ID_REG (DR_REG_HP_SYS_BASE + 0xcc)
/** HP_REG_L1_CACHE_BUS1_ID : R/W; bitpos: [3:0]; default: 0;
 *  NA
 */
#define HP_REG_L1_CACHE_BUS1_ID    0x0000000FU
#define HP_REG_L1_CACHE_BUS1_ID_M  (HP_REG_L1_CACHE_BUS1_ID_V << HP_REG_L1_CACHE_BUS1_ID_S)
#define HP_REG_L1_CACHE_BUS1_ID_V  0x0000000FU
#define HP_REG_L1_CACHE_BUS1_ID_S  0

/** HP_L2_MEM_RDN_ECO_CS_REG register
 *  NA
 */
#define HP_L2_MEM_RDN_ECO_CS_REG (DR_REG_HP_SYS_BASE + 0xd8)
/** HP_REG_L2_MEM_RDN_ECO_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_RDN_ECO_EN    (BIT(0))
#define HP_REG_L2_MEM_RDN_ECO_EN_M  (HP_REG_L2_MEM_RDN_ECO_EN_V << HP_REG_L2_MEM_RDN_ECO_EN_S)
#define HP_REG_L2_MEM_RDN_ECO_EN_V  0x00000001U
#define HP_REG_L2_MEM_RDN_ECO_EN_S  0
/** HP_REG_L2_MEM_RDN_ECO_RESULT : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_RDN_ECO_RESULT    (BIT(1))
#define HP_REG_L2_MEM_RDN_ECO_RESULT_M  (HP_REG_L2_MEM_RDN_ECO_RESULT_V << HP_REG_L2_MEM_RDN_ECO_RESULT_S)
#define HP_REG_L2_MEM_RDN_ECO_RESULT_V  0x00000001U
#define HP_REG_L2_MEM_RDN_ECO_RESULT_S  1

/** HP_L2_MEM_RDN_ECO_LOW_REG register
 *  NA
 */
#define HP_L2_MEM_RDN_ECO_LOW_REG (DR_REG_HP_SYS_BASE + 0xdc)
/** HP_REG_L2_MEM_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_RDN_ECO_LOW    0xFFFFFFFFU
#define HP_REG_L2_MEM_RDN_ECO_LOW_M  (HP_REG_L2_MEM_RDN_ECO_LOW_V << HP_REG_L2_MEM_RDN_ECO_LOW_S)
#define HP_REG_L2_MEM_RDN_ECO_LOW_V  0xFFFFFFFFU
#define HP_REG_L2_MEM_RDN_ECO_LOW_S  0

/** HP_L2_MEM_RDN_ECO_HIGH_REG register
 *  NA
 */
#define HP_L2_MEM_RDN_ECO_HIGH_REG (DR_REG_HP_SYS_BASE + 0xe0)
/** HP_REG_L2_MEM_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  NA
 */
#define HP_REG_L2_MEM_RDN_ECO_HIGH    0xFFFFFFFFU
#define HP_REG_L2_MEM_RDN_ECO_HIGH_M  (HP_REG_L2_MEM_RDN_ECO_HIGH_V << HP_REG_L2_MEM_RDN_ECO_HIGH_S)
#define HP_REG_L2_MEM_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define HP_REG_L2_MEM_RDN_ECO_HIGH_S  0

/** HP_TCM_RDN_ECO_CS_REG register
 *  NA
 */
#define HP_TCM_RDN_ECO_CS_REG (DR_REG_HP_SYS_BASE + 0xe4)
/** HP_REG_HP_TCM_RDN_ECO_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define HP_REG_HP_TCM_RDN_ECO_EN    (BIT(0))
#define HP_REG_HP_TCM_RDN_ECO_EN_M  (HP_REG_HP_TCM_RDN_ECO_EN_V << HP_REG_HP_TCM_RDN_ECO_EN_S)
#define HP_REG_HP_TCM_RDN_ECO_EN_V  0x00000001U
#define HP_REG_HP_TCM_RDN_ECO_EN_S  0
/** HP_REG_HP_TCM_RDN_ECO_RESULT : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define HP_REG_HP_TCM_RDN_ECO_RESULT    (BIT(1))
#define HP_REG_HP_TCM_RDN_ECO_RESULT_M  (HP_REG_HP_TCM_RDN_ECO_RESULT_V << HP_REG_HP_TCM_RDN_ECO_RESULT_S)
#define HP_REG_HP_TCM_RDN_ECO_RESULT_V  0x00000001U
#define HP_REG_HP_TCM_RDN_ECO_RESULT_S  1

/** HP_TCM_RDN_ECO_LOW_REG register
 *  NA
 */
#define HP_TCM_RDN_ECO_LOW_REG (DR_REG_HP_SYS_BASE + 0xe8)
/** HP_REG_HP_TCM_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define HP_REG_HP_TCM_RDN_ECO_LOW    0xFFFFFFFFU
#define HP_REG_HP_TCM_RDN_ECO_LOW_M  (HP_REG_HP_TCM_RDN_ECO_LOW_V << HP_REG_HP_TCM_RDN_ECO_LOW_S)
#define HP_REG_HP_TCM_RDN_ECO_LOW_V  0xFFFFFFFFU
#define HP_REG_HP_TCM_RDN_ECO_LOW_S  0

/** HP_TCM_RDN_ECO_HIGH_REG register
 *  NA
 */
#define HP_TCM_RDN_ECO_HIGH_REG (DR_REG_HP_SYS_BASE + 0xec)
/** HP_REG_HP_TCM_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  NA
 */
#define HP_REG_HP_TCM_RDN_ECO_HIGH    0xFFFFFFFFU
#define HP_REG_HP_TCM_RDN_ECO_HIGH_M  (HP_REG_HP_TCM_RDN_ECO_HIGH_V << HP_REG_HP_TCM_RDN_ECO_HIGH_S)
#define HP_REG_HP_TCM_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define HP_REG_HP_TCM_RDN_ECO_HIGH_S  0

/** HP_GPIO_DED_HOLD_CTRL_REG register
 *  NA
 */
#define HP_GPIO_DED_HOLD_CTRL_REG (DR_REG_HP_SYS_BASE + 0xf0)
/** HP_REG_GPIO_DED_HOLD : R/W; bitpos: [25:0]; default: 0;
 *  hold control for gpio63~56
 */
#define HP_REG_GPIO_DED_HOLD    0x03FFFFFFU
#define HP_REG_GPIO_DED_HOLD_M  (HP_REG_GPIO_DED_HOLD_V << HP_REG_GPIO_DED_HOLD_S)
#define HP_REG_GPIO_DED_HOLD_V  0x03FFFFFFU
#define HP_REG_GPIO_DED_HOLD_S  0

/** HP_L2_MEM_SW_ECC_BWE_MASK_REG register
 *  NA
 */
#define HP_L2_MEM_SW_ECC_BWE_MASK_REG (DR_REG_HP_SYS_BASE + 0xf4)
/** HP_REG_L2_MEM_SW_ECC_BWE_MASK_CTRL : R/W; bitpos: [0]; default: 0;
 *  Set 1 to mask bwe hamming code bit
 */
#define HP_REG_L2_MEM_SW_ECC_BWE_MASK_CTRL    (BIT(0))
#define HP_REG_L2_MEM_SW_ECC_BWE_MASK_CTRL_M  (HP_REG_L2_MEM_SW_ECC_BWE_MASK_CTRL_V << HP_REG_L2_MEM_SW_ECC_BWE_MASK_CTRL_S)
#define HP_REG_L2_MEM_SW_ECC_BWE_MASK_CTRL_V  0x00000001U
#define HP_REG_L2_MEM_SW_ECC_BWE_MASK_CTRL_S  0

/** HP_USB20OTG_MEM_CTRL_REG register
 *  NA
 */
#define HP_USB20OTG_MEM_CTRL_REG (DR_REG_HP_SYS_BASE + 0xf8)
/** HP_REG_USB20_MEM_CLK_FORCE_ON : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define HP_REG_USB20_MEM_CLK_FORCE_ON    (BIT(0))
#define HP_REG_USB20_MEM_CLK_FORCE_ON_M  (HP_REG_USB20_MEM_CLK_FORCE_ON_V << HP_REG_USB20_MEM_CLK_FORCE_ON_S)
#define HP_REG_USB20_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_REG_USB20_MEM_CLK_FORCE_ON_S  0

/** HP_TCM_INT_RAW_REG register
 *  need_des
 */
#define HP_TCM_INT_RAW_REG (DR_REG_HP_SYS_BASE + 0xfc)
/** HP_TCM_PARITY_ERR_INT_RAW : R/WTC/SS; bitpos: [31]; default: 0;
 *  need_des
 */
#define HP_TCM_PARITY_ERR_INT_RAW    (BIT(31))
#define HP_TCM_PARITY_ERR_INT_RAW_M  (HP_TCM_PARITY_ERR_INT_RAW_V << HP_TCM_PARITY_ERR_INT_RAW_S)
#define HP_TCM_PARITY_ERR_INT_RAW_V  0x00000001U
#define HP_TCM_PARITY_ERR_INT_RAW_S  31

