espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_reg.h
/** HP_TCM_INT_ST_REG register
 *  need_des
 */
#define HP_TCM_INT_ST_REG (DR_REG_HP_SYS_BASE + 0x100)
/** HP_TCM_PARITY_ERR_INT_ST : RO; bitpos: [31]; default: 0;
 *  need_des
 */
#define HP_TCM_PARITY_ERR_INT_ST    (BIT(31))
#define HP_TCM_PARITY_ERR_INT_ST_M  (HP_TCM_PARITY_ERR_INT_ST_V << HP_TCM_PARITY_ERR_INT_ST_S)
#define HP_TCM_PARITY_ERR_INT_ST_V  0x00000001U
#define HP_TCM_PARITY_ERR_INT_ST_S  31

/** HP_TCM_INT_ENA_REG register
 *  need_des
 */
#define HP_TCM_INT_ENA_REG (DR_REG_HP_SYS_BASE + 0x104)
/** HP_TCM_PARITY_ERR_INT_ENA : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define HP_TCM_PARITY_ERR_INT_ENA    (BIT(31))
#define HP_TCM_PARITY_ERR_INT_ENA_M  (HP_TCM_PARITY_ERR_INT_ENA_V << HP_TCM_PARITY_ERR_INT_ENA_S)
#define HP_TCM_PARITY_ERR_INT_ENA_V  0x00000001U
#define HP_TCM_PARITY_ERR_INT_ENA_S  31

/** HP_TCM_INT_CLR_REG register
 *  need_des
 */
#define HP_TCM_INT_CLR_REG (DR_REG_HP_SYS_BASE + 0x108)
/** HP_TCM_PARITY_ERR_INT_CLR : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define HP_TCM_PARITY_ERR_INT_CLR    (BIT(31))
#define HP_TCM_PARITY_ERR_INT_CLR_M  (HP_TCM_PARITY_ERR_INT_CLR_V << HP_TCM_PARITY_ERR_INT_CLR_S)
#define HP_TCM_PARITY_ERR_INT_CLR_V  0x00000001U
#define HP_TCM_PARITY_ERR_INT_CLR_S  31

/** HP_TCM_PARITY_INT_RECORD_REG register
 *  need_des
 */
#define HP_TCM_PARITY_INT_RECORD_REG (DR_REG_HP_SYS_BASE + 0x10c)
/** HP_TCM_PARITY_ERR_INT_ADDR : RO; bitpos: [12:0]; default: 0;
 *  hp tcm_parity_err_addr
 */
#define HP_TCM_PARITY_ERR_INT_ADDR    0x00001FFFU
#define HP_TCM_PARITY_ERR_INT_ADDR_M  (HP_TCM_PARITY_ERR_INT_ADDR_V << HP_TCM_PARITY_ERR_INT_ADDR_S)
#define HP_TCM_PARITY_ERR_INT_ADDR_V  0x00001FFFU
#define HP_TCM_PARITY_ERR_INT_ADDR_S  0

/** HP_L1_CACHE_PWR_CTRL_REG register
 *  NA
 */
#define HP_L1_CACHE_PWR_CTRL_REG (DR_REG_HP_SYS_BASE + 0x110)
/** HP_REG_L1_CACHE_MEM_FO : R/W; bitpos: [5:0]; default: 0;
 *  need_des
 */
#define HP_REG_L1_CACHE_MEM_FO    0x0000003FU
#define HP_REG_L1_CACHE_MEM_FO_M  (HP_REG_L1_CACHE_MEM_FO_V << HP_REG_L1_CACHE_MEM_FO_S)
#define HP_REG_L1_CACHE_MEM_FO_V  0x0000003FU
#define HP_REG_L1_CACHE_MEM_FO_S  0

/** HP_L2_CACHE_PWR_CTRL_REG register
 *  NA
 */
#define HP_L2_CACHE_PWR_CTRL_REG (DR_REG_HP_SYS_BASE + 0x114)
/** HP_REG_L2_CACHE_MEM_FO : R/W; bitpos: [1:0]; default: 0;
 *  need_des
 */
#define HP_REG_L2_CACHE_MEM_FO    0x00000003U
#define HP_REG_L2_CACHE_MEM_FO_M  (HP_REG_L2_CACHE_MEM_FO_V << HP_REG_L2_CACHE_MEM_FO_S)
#define HP_REG_L2_CACHE_MEM_FO_V  0x00000003U
#define HP_REG_L2_CACHE_MEM_FO_S  0

/** HP_CPU_WAITI_CONF_REG register
 *  CPU_WAITI configuration register
 */
#define HP_CPU_WAITI_CONF_REG (DR_REG_HP_SYS_BASE + 0x118)
/** HP_CPU_WAIT_MODE_FORCE_ON : R/W; bitpos: [0]; default: 1;
 *  Set 1 to force cpu_waiti_clk enable.
 */
#define HP_CPU_WAIT_MODE_FORCE_ON    (BIT(0))
#define HP_CPU_WAIT_MODE_FORCE_ON_M  (HP_CPU_WAIT_MODE_FORCE_ON_V << HP_CPU_WAIT_MODE_FORCE_ON_S)
#define HP_CPU_WAIT_MODE_FORCE_ON_V  0x00000001U
#define HP_CPU_WAIT_MODE_FORCE_ON_S  0
/** HP_CPU_WAITI_DELAY_NUM : R/W; bitpos: [4:1]; default: 0;
 *  This field used to set delay cycle when cpu enter waiti mode, after delay waiti_clk
 *  will close
 */
#define HP_CPU_WAITI_DELAY_NUM    0x0000000FU
#define HP_CPU_WAITI_DELAY_NUM_M  (HP_CPU_WAITI_DELAY_NUM_V << HP_CPU_WAITI_DELAY_NUM_S)
#define HP_CPU_WAITI_DELAY_NUM_V  0x0000000FU
#define HP_CPU_WAITI_DELAY_NUM_S  1

/** HP_SYS_CORE_DEBUG_RUNSTALL_CONF_REG register
 *  Core Debug runstall configure register
 */
#define HP_SYS_CORE_DEBUG_RUNSTALL_CONF_REG (DR_REG_HP_SYS_BASE + 0x11c)
/** HP_SYS_CORE_DEBUG_RUNSTALL_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Set this field to 1 to enable debug runstall feature between HP-core and LP-core.
 */
#define HP_SYS_CORE_DEBUG_RUNSTALL_ENABLE    (BIT(0))
#define HP_SYS_CORE_DEBUG_RUNSTALL_ENABLE_M  (HP_SYS_CORE_DEBUG_RUNSTALL_ENABLE_V << HP_SYS_CORE_DEBUG_RUNSTALL_ENABLE_S)
#define HP_SYS_CORE_DEBUG_RUNSTALL_ENABLE_V  0x00000001U
#define HP_SYS_CORE_DEBUG_RUNSTALL_ENABLE_S  0

/** HP_CORE_AHB_TIMEOUT_REG register
 *  need_des
 */
#define HP_CORE_AHB_TIMEOUT_REG (DR_REG_HP_SYS_BASE + 0x120)
/** HP_CORE_AHB_TIMEOUT_EN : R/W; bitpos: [0]; default: 1;
 *  set this field to 1 to enable hp core0&1 ahb timeout handle
 */
#define HP_CORE_AHB_TIMEOUT_EN    (BIT(0))
#define HP_CORE_AHB_TIMEOUT_EN_M  (HP_CORE_AHB_TIMEOUT_EN_V << HP_CORE_AHB_TIMEOUT_EN_S)
#define HP_CORE_AHB_TIMEOUT_EN_V  0x00000001U
#define HP_CORE_AHB_TIMEOUT_EN_S  0
/** HP_CORE_AHB_TIMEOUT_THRES : R/W; bitpos: [16:1]; default: 65535;
 *  This field used to set hp core0&1 ahb bus timeout  threshold
 */
#define HP_CORE_AHB_TIMEOUT_THRES    0x0000FFFFU
#define HP_CORE_AHB_TIMEOUT_THRES_M  (HP_CORE_AHB_TIMEOUT_THRES_V << HP_CORE_AHB_TIMEOUT_THRES_S)
#define HP_CORE_AHB_TIMEOUT_THRES_V  0x0000FFFFU
#define HP_CORE_AHB_TIMEOUT_THRES_S  1

/** HP_CORE_IBUS_TIMEOUT_REG register
 *  need_des
 */
#define HP_CORE_IBUS_TIMEOUT_REG (DR_REG_HP_SYS_BASE + 0x124)
/** HP_CORE_IBUS_TIMEOUT_EN : R/W; bitpos: [0]; default: 1;
 *  set this field to 1 to enable hp core0&1 ibus timeout handle
 */
#define HP_CORE_IBUS_TIMEOUT_EN    (BIT(0))
#define HP_CORE_IBUS_TIMEOUT_EN_M  (HP_CORE_IBUS_TIMEOUT_EN_V << HP_CORE_IBUS_TIMEOUT_EN_S)
#define HP_CORE_IBUS_TIMEOUT_EN_V  0x00000001U
#define HP_CORE_IBUS_TIMEOUT_EN_S  0
/** HP_CORE_IBUS_TIMEOUT_THRES : R/W; bitpos: [16:1]; default: 65535;
 *  This field used to set hp core0&1 ibus timeout  threshold
 */
#define HP_CORE_IBUS_TIMEOUT_THRES    0x0000FFFFU
#define HP_CORE_IBUS_TIMEOUT_THRES_M  (HP_CORE_IBUS_TIMEOUT_THRES_V << HP_CORE_IBUS_TIMEOUT_THRES_S)
#define HP_CORE_IBUS_TIMEOUT_THRES_V  0x0000FFFFU
#define HP_CORE_IBUS_TIMEOUT_THRES_S  1

/** HP_CORE_DBUS_TIMEOUT_REG register
 *  need_des
 */
#define HP_CORE_DBUS_TIMEOUT_REG (DR_REG_HP_SYS_BASE + 0x128)
/** HP_CORE_DBUS_TIMEOUT_EN : R/W; bitpos: [0]; default: 1;
 *  set this field to 1 to enable hp core0&1 dbus timeout handle
 */
#define HP_CORE_DBUS_TIMEOUT_EN    (BIT(0))
#define HP_CORE_DBUS_TIMEOUT_EN_M  (HP_CORE_DBUS_TIMEOUT_EN_V << HP_CORE_DBUS_TIMEOUT_EN_S)
#define HP_CORE_DBUS_TIMEOUT_EN_V  0x00000001U
#define HP_CORE_DBUS_TIMEOUT_EN_S  0
/** HP_CORE_DBUS_TIMEOUT_THRES : R/W; bitpos: [16:1]; default: 65535;
 *  This field used to set hp core0&1 dbus timeout  threshold
 */
#define HP_CORE_DBUS_TIMEOUT_THRES    0x0000FFFFU
#define HP_CORE_DBUS_TIMEOUT_THRES_M  (HP_CORE_DBUS_TIMEOUT_THRES_V << HP_CORE_DBUS_TIMEOUT_THRES_S)
#define HP_CORE_DBUS_TIMEOUT_THRES_V  0x0000FFFFU
#define HP_CORE_DBUS_TIMEOUT_THRES_S  1

/** HP_ICM_CPU_H2X_CFG_REG register
 *  need_des
 */
#define HP_ICM_CPU_H2X_CFG_REG (DR_REG_HP_SYS_BASE + 0x138)
/** HP_CPU_ICM_H2X_POST_WR_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_CPU_ICM_H2X_POST_WR_EN    (BIT(0))
#define HP_CPU_ICM_H2X_POST_WR_EN_M  (HP_CPU_ICM_H2X_POST_WR_EN_V << HP_CPU_ICM_H2X_POST_WR_EN_S)
#define HP_CPU_ICM_H2X_POST_WR_EN_V  0x00000001U
#define HP_CPU_ICM_H2X_POST_WR_EN_S  0
/** HP_CPU_ICM_H2X_CUT_THROUGH_EN : R/W; bitpos: [1]; default: 1;
 *  need_des
 */
#define HP_CPU_ICM_H2X_CUT_THROUGH_EN    (BIT(1))
#define HP_CPU_ICM_H2X_CUT_THROUGH_EN_M  (HP_CPU_ICM_H2X_CUT_THROUGH_EN_V << HP_CPU_ICM_H2X_CUT_THROUGH_EN_S)
#define HP_CPU_ICM_H2X_CUT_THROUGH_EN_V  0x00000001U
#define HP_CPU_ICM_H2X_CUT_THROUGH_EN_S  1
/** HP_CPU_ICM_H2X_BRIDGE_BUSY : RO; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_CPU_ICM_H2X_BRIDGE_BUSY    (BIT(2))
#define HP_CPU_ICM_H2X_BRIDGE_BUSY_M  (HP_CPU_ICM_H2X_BRIDGE_BUSY_V << HP_CPU_ICM_H2X_BRIDGE_BUSY_S)
#define HP_CPU_ICM_H2X_BRIDGE_BUSY_V  0x00000001U
#define HP_CPU_ICM_H2X_BRIDGE_BUSY_S  2

