espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_reg.h
/** HP_PERI1_APB_POSTW_EN_REG register
 *  NA
 */
#define HP_PERI1_APB_POSTW_EN_REG (DR_REG_HP_SYS_BASE + 0x13c)
/** HP_PERI1_APB_POSTW_EN : R/W; bitpos: [0]; default: 0;
 *  hp_peri1 apb register interface post write enable, 1 will speed up write, but will
 *  take some time to update value to register
 */
#define HP_PERI1_APB_POSTW_EN    (BIT(0))
#define HP_PERI1_APB_POSTW_EN_M  (HP_PERI1_APB_POSTW_EN_V << HP_PERI1_APB_POSTW_EN_S)
#define HP_PERI1_APB_POSTW_EN_V  0x00000001U
#define HP_PERI1_APB_POSTW_EN_S  0

/** HP_BITSCRAMBLER_PERI_SEL_REG register
 *  Bitscrambler Peri Sel
 */
#define HP_BITSCRAMBLER_PERI_SEL_REG (DR_REG_HP_SYS_BASE + 0x140)
/** HP_BITSCRAMBLER_PERI_RX_SEL : R/W; bitpos: [3:0]; default: 15;
 *  Set  this field to sel peri with DMA RX interface to connec with bitscrambler: 4'h0
 *  : lcd_cam, 4'h1: gpspi2, 4'h2: gpspi3, 4'h3: parl_io, 4'h4: aes, 4'h5: sha, 4'h6:
 *  adc, 4'h7: i2s0, 4'h8: i2s1, 4'h9: i2s2, 4'ha: i3c_mst, 4'hb: uhci0, 4'hc: RMT,
 *  else : none
 */
#define HP_BITSCRAMBLER_PERI_RX_SEL    0x0000000FU
#define HP_BITSCRAMBLER_PERI_RX_SEL_M  (HP_BITSCRAMBLER_PERI_RX_SEL_V << HP_BITSCRAMBLER_PERI_RX_SEL_S)
#define HP_BITSCRAMBLER_PERI_RX_SEL_V  0x0000000FU
#define HP_BITSCRAMBLER_PERI_RX_SEL_S  0
/** HP_BITSCRAMBLER_PERI_TX_SEL : R/W; bitpos: [7:4]; default: 15;
 *  Set  this field to sel peri with DMA TX interface to connec with bitscrambler: 4'h0
 *  : lcd_cam, 4'h1: gpspi2, 4'h2: gpspi3, 4'h3: parl_io, 4'h4: aes, 4'h5: sha, 4'h6:
 *  adc, 4'h7: i2s0, 4'h8: i2s1, 4'h9: i2s2, 4'ha: i3c_mst, 4'hb: uhci0, 4'hc: RMT,
 *  else : none
 */
#define HP_BITSCRAMBLER_PERI_TX_SEL    0x0000000FU
#define HP_BITSCRAMBLER_PERI_TX_SEL_M  (HP_BITSCRAMBLER_PERI_TX_SEL_V << HP_BITSCRAMBLER_PERI_TX_SEL_S)
#define HP_BITSCRAMBLER_PERI_TX_SEL_V  0x0000000FU
#define HP_BITSCRAMBLER_PERI_TX_SEL_S  4

/** HP_SYS_APB_SYNC_POSTW_EN_REG register
 *  N/A
 */
#define HP_SYS_APB_SYNC_POSTW_EN_REG (DR_REG_HP_SYS_BASE + 0x144)
/** HP_SYS_GMAC_APB_POSTW_EN : R/W; bitpos: [0]; default: 0;
 *  N/A
 */
#define HP_SYS_GMAC_APB_POSTW_EN    (BIT(0))
#define HP_SYS_GMAC_APB_POSTW_EN_M  (HP_SYS_GMAC_APB_POSTW_EN_V << HP_SYS_GMAC_APB_POSTW_EN_S)
#define HP_SYS_GMAC_APB_POSTW_EN_V  0x00000001U
#define HP_SYS_GMAC_APB_POSTW_EN_S  0
/** HP_SYS_DSI_HOST_APB_POSTW_EN : R/W; bitpos: [1]; default: 0;
 *  N/A
 */
#define HP_SYS_DSI_HOST_APB_POSTW_EN    (BIT(1))
#define HP_SYS_DSI_HOST_APB_POSTW_EN_M  (HP_SYS_DSI_HOST_APB_POSTW_EN_V << HP_SYS_DSI_HOST_APB_POSTW_EN_S)
#define HP_SYS_DSI_HOST_APB_POSTW_EN_V  0x00000001U
#define HP_SYS_DSI_HOST_APB_POSTW_EN_S  1
/** HP_SYS_CSI_HOST_APB_SYNC_POSTW_EN : R/W; bitpos: [2]; default: 0;
 *  N/A
 */
#define HP_SYS_CSI_HOST_APB_SYNC_POSTW_EN    (BIT(2))
#define HP_SYS_CSI_HOST_APB_SYNC_POSTW_EN_M  (HP_SYS_CSI_HOST_APB_SYNC_POSTW_EN_V << HP_SYS_CSI_HOST_APB_SYNC_POSTW_EN_S)
#define HP_SYS_CSI_HOST_APB_SYNC_POSTW_EN_V  0x00000001U
#define HP_SYS_CSI_HOST_APB_SYNC_POSTW_EN_S  2
/** HP_SYS_CSI_HOST_APB_ASYNC_POSTW_EN : R/W; bitpos: [3]; default: 0;
 *  N/A
 */
#define HP_SYS_CSI_HOST_APB_ASYNC_POSTW_EN    (BIT(3))
#define HP_SYS_CSI_HOST_APB_ASYNC_POSTW_EN_M  (HP_SYS_CSI_HOST_APB_ASYNC_POSTW_EN_V << HP_SYS_CSI_HOST_APB_ASYNC_POSTW_EN_S)
#define HP_SYS_CSI_HOST_APB_ASYNC_POSTW_EN_V  0x00000001U
#define HP_SYS_CSI_HOST_APB_ASYNC_POSTW_EN_S  3

/** HP_SYS_GDMA_CTRL_REG register
 *  N/A
 */
#define HP_SYS_GDMA_CTRL_REG (DR_REG_HP_SYS_BASE + 0x148)
/** HP_SYS_DEBUG_CH_NUM : R/W; bitpos: [1:0]; default: 0;
 *  N/A
 */
#define HP_SYS_DEBUG_CH_NUM    0x00000003U
#define HP_SYS_DEBUG_CH_NUM_M  (HP_SYS_DEBUG_CH_NUM_V << HP_SYS_DEBUG_CH_NUM_S)
#define HP_SYS_DEBUG_CH_NUM_V  0x00000003U
#define HP_SYS_DEBUG_CH_NUM_S  0

/** HP_SYS_GMAC_CTRL0_REG register
 *  N/A
 */
#define HP_SYS_GMAC_CTRL0_REG (DR_REG_HP_SYS_BASE + 0x14c)
/** HP_SYS_PTP_PPS : RO; bitpos: [0]; default: 0;
 *  N/A
 */
#define HP_SYS_PTP_PPS    (BIT(0))
#define HP_SYS_PTP_PPS_M  (HP_SYS_PTP_PPS_V << HP_SYS_PTP_PPS_S)
#define HP_SYS_PTP_PPS_V  0x00000001U
#define HP_SYS_PTP_PPS_S  0
/** HP_SYS_SBD_FLOWCTRL : R/W; bitpos: [1]; default: 0;
 *  N/A
 */
#define HP_SYS_SBD_FLOWCTRL    (BIT(1))
#define HP_SYS_SBD_FLOWCTRL_M  (HP_SYS_SBD_FLOWCTRL_V << HP_SYS_SBD_FLOWCTRL_S)
#define HP_SYS_SBD_FLOWCTRL_V  0x00000001U
#define HP_SYS_SBD_FLOWCTRL_S  1
/** HP_SYS_PHY_INTF_SEL : R/W; bitpos: [4:2]; default: 0;
 *  N/A
 */
#define HP_SYS_PHY_INTF_SEL    0x00000007U
#define HP_SYS_PHY_INTF_SEL_M  (HP_SYS_PHY_INTF_SEL_V << HP_SYS_PHY_INTF_SEL_S)
#define HP_SYS_PHY_INTF_SEL_V  0x00000007U
#define HP_SYS_PHY_INTF_SEL_S  2
/** HP_SYS_GMAC_MEM_CLK_FORCE_ON : R/W; bitpos: [5]; default: 0;
 *  N/A
 */
#define HP_SYS_GMAC_MEM_CLK_FORCE_ON    (BIT(5))
#define HP_SYS_GMAC_MEM_CLK_FORCE_ON_M  (HP_SYS_GMAC_MEM_CLK_FORCE_ON_V << HP_SYS_GMAC_MEM_CLK_FORCE_ON_S)
#define HP_SYS_GMAC_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_GMAC_MEM_CLK_FORCE_ON_S  5
/** HP_SYS_GMAC_RST_CLK_TX_N : RO; bitpos: [6]; default: 0;
 *  N/A
 */
#define HP_SYS_GMAC_RST_CLK_TX_N    (BIT(6))
#define HP_SYS_GMAC_RST_CLK_TX_N_M  (HP_SYS_GMAC_RST_CLK_TX_N_V << HP_SYS_GMAC_RST_CLK_TX_N_S)
#define HP_SYS_GMAC_RST_CLK_TX_N_V  0x00000001U
#define HP_SYS_GMAC_RST_CLK_TX_N_S  6
/** HP_SYS_GMAC_RST_CLK_RX_N : RO; bitpos: [7]; default: 0;
 *  N/A
 */
#define HP_SYS_GMAC_RST_CLK_RX_N    (BIT(7))
#define HP_SYS_GMAC_RST_CLK_RX_N_M  (HP_SYS_GMAC_RST_CLK_RX_N_V << HP_SYS_GMAC_RST_CLK_RX_N_S)
#define HP_SYS_GMAC_RST_CLK_RX_N_V  0x00000001U
#define HP_SYS_GMAC_RST_CLK_RX_N_S  7

/** HP_SYS_GMAC_CTRL1_REG register
 *  N/A
 */
#define HP_SYS_GMAC_CTRL1_REG (DR_REG_HP_SYS_BASE + 0x150)
/** HP_SYS_PTP_TIMESTAMP_L : RO; bitpos: [31:0]; default: 0;
 *  N/A
 */
#define HP_SYS_PTP_TIMESTAMP_L    0xFFFFFFFFU
#define HP_SYS_PTP_TIMESTAMP_L_M  (HP_SYS_PTP_TIMESTAMP_L_V << HP_SYS_PTP_TIMESTAMP_L_S)
#define HP_SYS_PTP_TIMESTAMP_L_V  0xFFFFFFFFU
#define HP_SYS_PTP_TIMESTAMP_L_S  0

/** HP_SYS_GMAC_CTRL2_REG register
 *  N/A
 */
#define HP_SYS_GMAC_CTRL2_REG (DR_REG_HP_SYS_BASE + 0x154)
/** HP_SYS_PTP_TIMESTAMP_H : RO; bitpos: [31:0]; default: 0;
 *  N/A
 */
#define HP_SYS_PTP_TIMESTAMP_H    0xFFFFFFFFU
#define HP_SYS_PTP_TIMESTAMP_H_M  (HP_SYS_PTP_TIMESTAMP_H_V << HP_SYS_PTP_TIMESTAMP_H_S)
#define HP_SYS_PTP_TIMESTAMP_H_V  0xFFFFFFFFU
#define HP_SYS_PTP_TIMESTAMP_H_S  0

/** HP_SYS_VPU_CTRL_REG register
 *  N/A
 */
#define HP_SYS_VPU_CTRL_REG (DR_REG_HP_SYS_BASE + 0x158)
/** HP_SYS_PPA_LSLP_MEM_PD : R/W; bitpos: [0]; default: 0;
 *  N/A
 */
#define HP_SYS_PPA_LSLP_MEM_PD    (BIT(0))
#define HP_SYS_PPA_LSLP_MEM_PD_M  (HP_SYS_PPA_LSLP_MEM_PD_V << HP_SYS_PPA_LSLP_MEM_PD_S)
#define HP_SYS_PPA_LSLP_MEM_PD_V  0x00000001U
#define HP_SYS_PPA_LSLP_MEM_PD_S  0
/** HP_SYS_JPEG_SDSLP_MEM_PD : R/W; bitpos: [1]; default: 0;
 *  N/A
 */
#define HP_SYS_JPEG_SDSLP_MEM_PD    (BIT(1))
#define HP_SYS_JPEG_SDSLP_MEM_PD_M  (HP_SYS_JPEG_SDSLP_MEM_PD_V << HP_SYS_JPEG_SDSLP_MEM_PD_S)
#define HP_SYS_JPEG_SDSLP_MEM_PD_V  0x00000001U
#define HP_SYS_JPEG_SDSLP_MEM_PD_S  1
/** HP_SYS_JPEG_LSLP_MEM_PD : R/W; bitpos: [2]; default: 0;
 *  N/A
 */
#define HP_SYS_JPEG_LSLP_MEM_PD    (BIT(2))
#define HP_SYS_JPEG_LSLP_MEM_PD_M  (HP_SYS_JPEG_LSLP_MEM_PD_V << HP_SYS_JPEG_LSLP_MEM_PD_S)
#define HP_SYS_JPEG_LSLP_MEM_PD_V  0x00000001U
#define HP_SYS_JPEG_LSLP_MEM_PD_S  2
/** HP_SYS_JPEG_DSLP_MEM_PD : R/W; bitpos: [3]; default: 0;
 *  N/A
 */
#define HP_SYS_JPEG_DSLP_MEM_PD    (BIT(3))
#define HP_SYS_JPEG_DSLP_MEM_PD_M  (HP_SYS_JPEG_DSLP_MEM_PD_V << HP_SYS_JPEG_DSLP_MEM_PD_S)
#define HP_SYS_JPEG_DSLP_MEM_PD_V  0x00000001U
#define HP_SYS_JPEG_DSLP_MEM_PD_S  3
/** HP_SYS_DMA2D_LSLP_MEM_PD : R/W; bitpos: [4]; default: 0;
 *  N/A
 */
#define HP_SYS_DMA2D_LSLP_MEM_PD    (BIT(4))
#define HP_SYS_DMA2D_LSLP_MEM_PD_M  (HP_SYS_DMA2D_LSLP_MEM_PD_V << HP_SYS_DMA2D_LSLP_MEM_PD_S)
#define HP_SYS_DMA2D_LSLP_MEM_PD_V  0x00000001U
#define HP_SYS_DMA2D_LSLP_MEM_PD_S  4

/** HP_SYS_USBOTG20_CTRL_REG register
 *  N/A
 */
#define HP_SYS_USBOTG20_CTRL_REG (DR_REG_HP_SYS_BASE + 0x15c)
/** HP_SYS_OTG_PHY_TEST_DONE : RO; bitpos: [0]; default: 0;
 *  N/A
 */
#define HP_SYS_OTG_PHY_TEST_DONE    (BIT(0))
#define HP_SYS_OTG_PHY_TEST_DONE_M  (HP_SYS_OTG_PHY_TEST_DONE_V << HP_SYS_OTG_PHY_TEST_DONE_S)
#define HP_SYS_OTG_PHY_TEST_DONE_V  0x00000001U
#define HP_SYS_OTG_PHY_TEST_DONE_S  0
/** HP_SYS_USB_MEM_AUX_CTRL : R/W; bitpos: [14:1]; default: 4896;
 *  N/A
 */
#define HP_SYS_USB_MEM_AUX_CTRL    0x00003FFFU
#define HP_SYS_USB_MEM_AUX_CTRL_M  (HP_SYS_USB_MEM_AUX_CTRL_V << HP_SYS_USB_MEM_AUX_CTRL_S)
#define HP_SYS_USB_MEM_AUX_CTRL_V  0x00003FFFU
#define HP_SYS_USB_MEM_AUX_CTRL_S  1
/** HP_SYS_PHY_SUSPENDM : R/W; bitpos: [15]; default: 0;
 *  N/A
 */
#define HP_SYS_PHY_SUSPENDM    (BIT(15))
#define HP_SYS_PHY_SUSPENDM_M  (HP_SYS_PHY_SUSPENDM_V << HP_SYS_PHY_SUSPENDM_S)
#define HP_SYS_PHY_SUSPENDM_V  0x00000001U
#define HP_SYS_PHY_SUSPENDM_S  15
/** HP_SYS_PHY_SUSPEND_FORCE_EN : R/W; bitpos: [16]; default: 0;
 *  N/A
 */
#define HP_SYS_PHY_SUSPEND_FORCE_EN    (BIT(16))
#define HP_SYS_PHY_SUSPEND_FORCE_EN_M  (HP_SYS_PHY_SUSPEND_FORCE_EN_V << HP_SYS_PHY_SUSPEND_FORCE_EN_S)
#define HP_SYS_PHY_SUSPEND_FORCE_EN_V  0x00000001U
#define HP_SYS_PHY_SUSPEND_FORCE_EN_S  16
/** HP_SYS_PHY_RSTN : R/W; bitpos: [17]; default: 1;
 *  N/A
 */
#define HP_SYS_PHY_RSTN    (BIT(17))
#define HP_SYS_PHY_RSTN_M  (HP_SYS_PHY_RSTN_V << HP_SYS_PHY_RSTN_S)
#define HP_SYS_PHY_RSTN_V  0x00000001U
#define HP_SYS_PHY_RSTN_S  17
/** HP_SYS_PHY_RESET_FORCE_EN : R/W; bitpos: [18]; default: 0;
 *  N/A
 */
#define HP_SYS_PHY_RESET_FORCE_EN    (BIT(18))
#define HP_SYS_PHY_RESET_FORCE_EN_M  (HP_SYS_PHY_RESET_FORCE_EN_V << HP_SYS_PHY_RESET_FORCE_EN_S)
#define HP_SYS_PHY_RESET_FORCE_EN_V  0x00000001U
#define HP_SYS_PHY_RESET_FORCE_EN_S  18
/** HP_SYS_PHY_PLL_FORCE_EN : R/W; bitpos: [19]; default: 0;
 *  N/A
 */
#define HP_SYS_PHY_PLL_FORCE_EN    (BIT(19))
#define HP_SYS_PHY_PLL_FORCE_EN_M  (HP_SYS_PHY_PLL_FORCE_EN_V << HP_SYS_PHY_PLL_FORCE_EN_S)
#define HP_SYS_PHY_PLL_FORCE_EN_V  0x00000001U
#define HP_SYS_PHY_PLL_FORCE_EN_S  19
/** HP_SYS_PHY_PLL_EN : R/W; bitpos: [20]; default: 0;
 *  N/A
 */
#define HP_SYS_PHY_PLL_EN    (BIT(20))
#define HP_SYS_PHY_PLL_EN_M  (HP_SYS_PHY_PLL_EN_V << HP_SYS_PHY_PLL_EN_S)
#define HP_SYS_PHY_PLL_EN_V  0x00000001U
#define HP_SYS_PHY_PLL_EN_S  20
/** HP_SYS_OTG_SUSPENDM : R/W; bitpos: [21]; default: 0;
 *  N/A
 */
#define HP_SYS_OTG_SUSPENDM    (BIT(21))
#define HP_SYS_OTG_SUSPENDM_M  (HP_SYS_OTG_SUSPENDM_V << HP_SYS_OTG_SUSPENDM_S)
#define HP_SYS_OTG_SUSPENDM_V  0x00000001U
#define HP_SYS_OTG_SUSPENDM_S  21
/** HP_SYS_OTG_PHY_TXBITSTUFF_EN : R/W; bitpos: [22]; default: 0;
 *  N/A
 */
#define HP_SYS_OTG_PHY_TXBITSTUFF_EN    (BIT(22))
#define HP_SYS_OTG_PHY_TXBITSTUFF_EN_M  (HP_SYS_OTG_PHY_TXBITSTUFF_EN_V << HP_SYS_OTG_PHY_TXBITSTUFF_EN_S)
#define HP_SYS_OTG_PHY_TXBITSTUFF_EN_V  0x00000001U
#define HP_SYS_OTG_PHY_TXBITSTUFF_EN_S  22
/** HP_SYS_OTG_PHY_REFCLK_MODE : R/W; bitpos: [23]; default: 1;
 *  N/A
 */
#define HP_SYS_OTG_PHY_REFCLK_MODE    (BIT(23))
#define HP_SYS_OTG_PHY_REFCLK_MODE_M  (HP_SYS_OTG_PHY_REFCLK_MODE_V << HP_SYS_OTG_PHY_REFCLK_MODE_S)
#define HP_SYS_OTG_PHY_REFCLK_MODE_V  0x00000001U
#define HP_SYS_OTG_PHY_REFCLK_MODE_S  23
/** HP_SYS_OTG_PHY_BISTEN : R/W; bitpos: [24]; default: 0;
 *  N/A
 */
#define HP_SYS_OTG_PHY_BISTEN    (BIT(24))
#define HP_SYS_OTG_PHY_BISTEN_M  (HP_SYS_OTG_PHY_BISTEN_V << HP_SYS_OTG_PHY_BISTEN_S)
#define HP_SYS_OTG_PHY_BISTEN_V  0x00000001U
#define HP_SYS_OTG_PHY_BISTEN_S  24

/** HP_TCM_ERR_RESP_CTRL_REG register
 *  need_des
 */
#define HP_TCM_ERR_RESP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x160)
/** HP_TCM_ERR_RESP_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to turn on tcm error response
 */
#define HP_TCM_ERR_RESP_EN    (BIT(0))
#define HP_TCM_ERR_RESP_EN_M  (HP_TCM_ERR_RESP_EN_V << HP_TCM_ERR_RESP_EN_S)
#define HP_TCM_ERR_RESP_EN_V  0x00000001U
#define HP_TCM_ERR_RESP_EN_S  0

/** HP_L2_MEM_REFRESH_REG register
 *  NA
 */
#define HP_L2_MEM_REFRESH_REG (DR_REG_HP_SYS_BASE + 0x164)
/** HP_REG_L2_MEM_UNIT0_REFERSH_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_UNIT0_REFERSH_EN    (BIT(0))
#define HP_REG_L2_MEM_UNIT0_REFERSH_EN_M  (HP_REG_L2_MEM_UNIT0_REFERSH_EN_V << HP_REG_L2_MEM_UNIT0_REFERSH_EN_S)
#define HP_REG_L2_MEM_UNIT0_REFERSH_EN_V  0x00000001U
#define HP_REG_L2_MEM_UNIT0_REFERSH_EN_S  0
/** HP_REG_L2_MEM_UNIT1_REFERSH_EN : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_UNIT1_REFERSH_EN    (BIT(1))
#define HP_REG_L2_MEM_UNIT1_REFERSH_EN_M  (HP_REG_L2_MEM_UNIT1_REFERSH_EN_V << HP_REG_L2_MEM_UNIT1_REFERSH_EN_S)
#define HP_REG_L2_MEM_UNIT1_REFERSH_EN_V  0x00000001U
#define HP_REG_L2_MEM_UNIT1_REFERSH_EN_S  1
/** HP_REG_L2_MEM_UNIT2_REFERSH_EN : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_UNIT2_REFERSH_EN    (BIT(2))
#define HP_REG_L2_MEM_UNIT2_REFERSH_EN_M  (HP_REG_L2_MEM_UNIT2_REFERSH_EN_V << HP_REG_L2_MEM_UNIT2_REFERSH_EN_S)
#define HP_REG_L2_MEM_UNIT2_REFERSH_EN_V  0x00000001U
#define HP_REG_L2_MEM_UNIT2_REFERSH_EN_S  2
/** HP_REG_L2_MEM_UNIT3_REFERSH_EN : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_UNIT3_REFERSH_EN    (BIT(3))
#define HP_REG_L2_MEM_UNIT3_REFERSH_EN_M  (HP_REG_L2_MEM_UNIT3_REFERSH_EN_V << HP_REG_L2_MEM_UNIT3_REFERSH_EN_S)
#define HP_REG_L2_MEM_UNIT3_REFERSH_EN_V  0x00000001U
#define HP_REG_L2_MEM_UNIT3_REFERSH_EN_S  3
/** HP_REG_L2_MEM_UNIT4_REFERSH_EN : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_UNIT4_REFERSH_EN    (BIT(4))
#define HP_REG_L2_MEM_UNIT4_REFERSH_EN_M  (HP_REG_L2_MEM_UNIT4_REFERSH_EN_V << HP_REG_L2_MEM_UNIT4_REFERSH_EN_S)
#define HP_REG_L2_MEM_UNIT4_REFERSH_EN_V  0x00000001U
#define HP_REG_L2_MEM_UNIT4_REFERSH_EN_S  4
/** HP_REG_L2_MEM_UNIT5_REFERSH_EN : R/W; bitpos: [5]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_UNIT5_REFERSH_EN    (BIT(5))
#define HP_REG_L2_MEM_UNIT5_REFERSH_EN_M  (HP_REG_L2_MEM_UNIT5_REFERSH_EN_V << HP_REG_L2_MEM_UNIT5_REFERSH_EN_S)
#define HP_REG_L2_MEM_UNIT5_REFERSH_EN_V  0x00000001U
#define HP_REG_L2_MEM_UNIT5_REFERSH_EN_S  5
/** HP_REG_L2_MEM_REFERSH_CNT_RESET : R/W; bitpos: [6]; default: 1;
 *  Set 1 to reset l2mem_refresh_cnt
 */
#define HP_REG_L2_MEM_REFERSH_CNT_RESET    (BIT(6))
#define HP_REG_L2_MEM_REFERSH_CNT_RESET_M  (HP_REG_L2_MEM_REFERSH_CNT_RESET_V << HP_REG_L2_MEM_REFERSH_CNT_RESET_S)
#define HP_REG_L2_MEM_REFERSH_CNT_RESET_V  0x00000001U
#define HP_REG_L2_MEM_REFERSH_CNT_RESET_S  6
/** HP_REG_L2_MEM_UNIT0_REFRESH_DONE : RO; bitpos: [7]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_UNIT0_REFRESH_DONE    (BIT(7))
#define HP_REG_L2_MEM_UNIT0_REFRESH_DONE_M  (HP_REG_L2_MEM_UNIT0_REFRESH_DONE_V << HP_REG_L2_MEM_UNIT0_REFRESH_DONE_S)
#define HP_REG_L2_MEM_UNIT0_REFRESH_DONE_V  0x00000001U
#define HP_REG_L2_MEM_UNIT0_REFRESH_DONE_S  7
/** HP_REG_L2_MEM_UNIT1_REFRESH_DONE : RO; bitpos: [8]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_UNIT1_REFRESH_DONE    (BIT(8))
#define HP_REG_L2_MEM_UNIT1_REFRESH_DONE_M  (HP_REG_L2_MEM_UNIT1_REFRESH_DONE_V << HP_REG_L2_MEM_UNIT1_REFRESH_DONE_S)
#define HP_REG_L2_MEM_UNIT1_REFRESH_DONE_V  0x00000001U
#define HP_REG_L2_MEM_UNIT1_REFRESH_DONE_S  8
/** HP_REG_L2_MEM_UNIT2_REFRESH_DONE : RO; bitpos: [9]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_UNIT2_REFRESH_DONE    (BIT(9))
#define HP_REG_L2_MEM_UNIT2_REFRESH_DONE_M  (HP_REG_L2_MEM_UNIT2_REFRESH_DONE_V << HP_REG_L2_MEM_UNIT2_REFRESH_DONE_S)
#define HP_REG_L2_MEM_UNIT2_REFRESH_DONE_V  0x00000001U
#define HP_REG_L2_MEM_UNIT2_REFRESH_DONE_S  9
/** HP_REG_L2_MEM_UNIT3_REFRESH_DONE : RO; bitpos: [10]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_UNIT3_REFRESH_DONE    (BIT(10))
#define HP_REG_L2_MEM_UNIT3_REFRESH_DONE_M  (HP_REG_L2_MEM_UNIT3_REFRESH_DONE_V << HP_REG_L2_MEM_UNIT3_REFRESH_DONE_S)
#define HP_REG_L2_MEM_UNIT3_REFRESH_DONE_V  0x00000001U
#define HP_REG_L2_MEM_UNIT3_REFRESH_DONE_S  10
/** HP_REG_L2_MEM_UNIT4_REFRESH_DONE : RO; bitpos: [11]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_UNIT4_REFRESH_DONE    (BIT(11))
#define HP_REG_L2_MEM_UNIT4_REFRESH_DONE_M  (HP_REG_L2_MEM_UNIT4_REFRESH_DONE_V << HP_REG_L2_MEM_UNIT4_REFRESH_DONE_S)
#define HP_REG_L2_MEM_UNIT4_REFRESH_DONE_V  0x00000001U
#define HP_REG_L2_MEM_UNIT4_REFRESH_DONE_S  11
/** HP_REG_L2_MEM_UNIT5_REFRESH_DONE : RO; bitpos: [12]; default: 0;
 *  NA
 */
#define HP_REG_L2_MEM_UNIT5_REFRESH_DONE    (BIT(12))
#define HP_REG_L2_MEM_UNIT5_REFRESH_DONE_M  (HP_REG_L2_MEM_UNIT5_REFRESH_DONE_V << HP_REG_L2_MEM_UNIT5_REFRESH_DONE_S)
#define HP_REG_L2_MEM_UNIT5_REFRESH_DONE_V  0x00000001U
#define HP_REG_L2_MEM_UNIT5_REFRESH_DONE_S  12

/** HP_TCM_INIT_REG register
 *  NA
 */
#define HP_TCM_INIT_REG (DR_REG_HP_SYS_BASE + 0x168)
/** HP_REG_TCM_INIT_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define HP_REG_TCM_INIT_EN    (BIT(0))
#define HP_REG_TCM_INIT_EN_M  (HP_REG_TCM_INIT_EN_V << HP_REG_TCM_INIT_EN_S)
#define HP_REG_TCM_INIT_EN_V  0x00000001U
#define HP_REG_TCM_INIT_EN_S  0
/** HP_REG_TCM_INIT_CNT_RESET : R/W; bitpos: [1]; default: 1;
 *  Set 1 to reset tcm init cnt
 */
#define HP_REG_TCM_INIT_CNT_RESET    (BIT(1))
#define HP_REG_TCM_INIT_CNT_RESET_M  (HP_REG_TCM_INIT_CNT_RESET_V << HP_REG_TCM_INIT_CNT_RESET_S)
#define HP_REG_TCM_INIT_CNT_RESET_V  0x00000001U
#define HP_REG_TCM_INIT_CNT_RESET_S  1
/** HP_REG_TCM_INIT_DONE : RO; bitpos: [2]; default: 0;
 *  NA
 */
#define HP_REG_TCM_INIT_DONE    (BIT(2))
#define HP_REG_TCM_INIT_DONE_M  (HP_REG_TCM_INIT_DONE_V << HP_REG_TCM_INIT_DONE_S)
#define HP_REG_TCM_INIT_DONE_V  0x00000001U
#define HP_REG_TCM_INIT_DONE_S  2

