espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_reg.h
/** HP_TCM_PARITY_CHECK_CTRL_REG register
 *  need_des
 */
#define HP_TCM_PARITY_CHECK_CTRL_REG (DR_REG_HP_SYS_BASE + 0x16c)
/** HP_TCM_PARITY_CHECK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to turn on tcm parity check
 */
#define HP_TCM_PARITY_CHECK_EN    (BIT(0))
#define HP_TCM_PARITY_CHECK_EN_M  (HP_TCM_PARITY_CHECK_EN_V << HP_TCM_PARITY_CHECK_EN_S)
#define HP_TCM_PARITY_CHECK_EN_V  0x00000001U
#define HP_TCM_PARITY_CHECK_EN_S  0

/** HP_DESIGN_FOR_VERIFICATION0_REG register
 *  need_des
 */
#define HP_DESIGN_FOR_VERIFICATION0_REG (DR_REG_HP_SYS_BASE + 0x170)
/** HP_DFV0 : R/W; bitpos: [31:0]; default: 0;
 *  register for DV
 */
#define HP_DFV0    0xFFFFFFFFU
#define HP_DFV0_M  (HP_DFV0_V << HP_DFV0_S)
#define HP_DFV0_V  0xFFFFFFFFU
#define HP_DFV0_S  0

/** HP_DESIGN_FOR_VERIFICATION1_REG register
 *  need_des
 */
#define HP_DESIGN_FOR_VERIFICATION1_REG (DR_REG_HP_SYS_BASE + 0x174)
/** HP_DFV1 : R/W; bitpos: [31:0]; default: 0;
 *  register for DV
 */
#define HP_DFV1    0xFFFFFFFFU
#define HP_DFV1_M  (HP_DFV1_V << HP_DFV1_S)
#define HP_DFV1_V  0xFFFFFFFFU
#define HP_DFV1_S  0

/** HP_PSRAM_FLASH_ADDR_INTERCHANGE_REG register
 *  need_des
 */
#define HP_PSRAM_FLASH_ADDR_INTERCHANGE_REG (DR_REG_HP_SYS_BASE + 0x180)
/** HP_PSRAM_FLASH_ADDR_INTERCHANGE_CPU : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable addr interchange between psram and flash in axi matrix when hp cpu
 *  access through cache
 */
#define HP_PSRAM_FLASH_ADDR_INTERCHANGE_CPU    (BIT(0))
#define HP_PSRAM_FLASH_ADDR_INTERCHANGE_CPU_M  (HP_PSRAM_FLASH_ADDR_INTERCHANGE_CPU_V << HP_PSRAM_FLASH_ADDR_INTERCHANGE_CPU_S)
#define HP_PSRAM_FLASH_ADDR_INTERCHANGE_CPU_V  0x00000001U
#define HP_PSRAM_FLASH_ADDR_INTERCHANGE_CPU_S  0
/** HP_PSRAM_FLASH_ADDR_INTERCHANGE_DMA : R/W; bitpos: [1]; default: 0;
 *  Set 1 to enable addr interchange between psram and flash in axi matrix when dma
 *  device access, lp core access and hp core access through ahb
 */
#define HP_PSRAM_FLASH_ADDR_INTERCHANGE_DMA    (BIT(1))
#define HP_PSRAM_FLASH_ADDR_INTERCHANGE_DMA_M  (HP_PSRAM_FLASH_ADDR_INTERCHANGE_DMA_V << HP_PSRAM_FLASH_ADDR_INTERCHANGE_DMA_S)
#define HP_PSRAM_FLASH_ADDR_INTERCHANGE_DMA_V  0x00000001U
#define HP_PSRAM_FLASH_ADDR_INTERCHANGE_DMA_S  1

/** HP_AHB2AXI_BRESP_ERR_INT_RAW_REG register
 *  NA
 */
#define HP_AHB2AXI_BRESP_ERR_INT_RAW_REG (DR_REG_HP_SYS_BASE + 0x188)
/** HP_CPU_ICM_H2X_BRESP_ERR_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  the raw interrupt status of bresp error,  triggered when if  bresp err occurs  in
 *  post write mode in ahb2axi.
 */
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_RAW    (BIT(0))
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_RAW_M  (HP_CPU_ICM_H2X_BRESP_ERR_INT_RAW_V << HP_CPU_ICM_H2X_BRESP_ERR_INT_RAW_S)
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_RAW_V  0x00000001U
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_RAW_S  0

/** HP_AHB2AXI_BRESP_ERR_INT_ST_REG register
 *  need_des
 */
#define HP_AHB2AXI_BRESP_ERR_INT_ST_REG (DR_REG_HP_SYS_BASE + 0x18c)
/** HP_CPU_ICM_H2X_BRESP_ERR_INT_ST : RO; bitpos: [31]; default: 0;
 *  the masked interrupt status of  cpu_icm_h2x_bresp_err
 */
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_ST    (BIT(31))
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_ST_M  (HP_CPU_ICM_H2X_BRESP_ERR_INT_ST_V << HP_CPU_ICM_H2X_BRESP_ERR_INT_ST_S)
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_ST_V  0x00000001U
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_ST_S  31

/** HP_AHB2AXI_BRESP_ERR_INT_ENA_REG register
 *  need_des
 */
#define HP_AHB2AXI_BRESP_ERR_INT_ENA_REG (DR_REG_HP_SYS_BASE + 0x190)
/** HP_CPU_ICM_H2X_BRESP_ERR_INT_ENA : R/W; bitpos: [31]; default: 0;
 *  Write 1 to enable cpu_icm_h2x_bresp_err int
 */
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_ENA    (BIT(31))
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_ENA_M  (HP_CPU_ICM_H2X_BRESP_ERR_INT_ENA_V << HP_CPU_ICM_H2X_BRESP_ERR_INT_ENA_S)
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_ENA_V  0x00000001U
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_ENA_S  31

/** HP_AHB2AXI_BRESP_ERR_INT_CLR_REG register
 *  need_des
 */
#define HP_AHB2AXI_BRESP_ERR_INT_CLR_REG (DR_REG_HP_SYS_BASE + 0x194)
/** HP_CPU_ICM_H2X_BRESP_ERR_INT_CLR : WT; bitpos: [31]; default: 0;
 *  Write 1 to clear cpu_icm_h2x_bresp_err  int
 */
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_CLR    (BIT(31))
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_CLR_M  (HP_CPU_ICM_H2X_BRESP_ERR_INT_CLR_V << HP_CPU_ICM_H2X_BRESP_ERR_INT_CLR_S)
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_CLR_V  0x00000001U
#define HP_CPU_ICM_H2X_BRESP_ERR_INT_CLR_S  31

/** HP_L2_MEM_ERR_RESP_CTRL_REG register
 *  need_des
 */
#define HP_L2_MEM_ERR_RESP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x198)
/** HP_L2_MEM_ERR_RESP_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to turn on l2mem error response
 */
#define HP_L2_MEM_ERR_RESP_EN    (BIT(0))
#define HP_L2_MEM_ERR_RESP_EN_M  (HP_L2_MEM_ERR_RESP_EN_V << HP_L2_MEM_ERR_RESP_EN_S)
#define HP_L2_MEM_ERR_RESP_EN_V  0x00000001U
#define HP_L2_MEM_ERR_RESP_EN_S  0

/** HP_L2_MEM_AHB_BUFFER_CTRL_REG register
 *  need_des
 */
#define HP_L2_MEM_AHB_BUFFER_CTRL_REG (DR_REG_HP_SYS_BASE + 0x19c)
/** HP_L2_MEM_AHB_WRBUFFER_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to turn on l2mem ahb wr buffer
 */
#define HP_L2_MEM_AHB_WRBUFFER_EN    (BIT(0))
#define HP_L2_MEM_AHB_WRBUFFER_EN_M  (HP_L2_MEM_AHB_WRBUFFER_EN_V << HP_L2_MEM_AHB_WRBUFFER_EN_S)
#define HP_L2_MEM_AHB_WRBUFFER_EN_V  0x00000001U
#define HP_L2_MEM_AHB_WRBUFFER_EN_S  0
/** HP_L2_MEM_AHB_RDBUFFER_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to turn on l2mem ahb rd buffer
 */
#define HP_L2_MEM_AHB_RDBUFFER_EN    (BIT(1))
#define HP_L2_MEM_AHB_RDBUFFER_EN_M  (HP_L2_MEM_AHB_RDBUFFER_EN_V << HP_L2_MEM_AHB_RDBUFFER_EN_S)
#define HP_L2_MEM_AHB_RDBUFFER_EN_V  0x00000001U
#define HP_L2_MEM_AHB_RDBUFFER_EN_S  1

/** HP_CORE_DMACTIVE_LPCORE_REG register
 *  need_des
 */
#define HP_CORE_DMACTIVE_LPCORE_REG (DR_REG_HP_SYS_BASE + 0x1a0)
/** HP_CORE_DMACTIVE_LPCORE : RO; bitpos: [0]; default: 0;
 *  hp core dmactive_lpcore value
 */
#define HP_CORE_DMACTIVE_LPCORE    (BIT(0))
#define HP_CORE_DMACTIVE_LPCORE_M  (HP_CORE_DMACTIVE_LPCORE_V << HP_CORE_DMACTIVE_LPCORE_S)
#define HP_CORE_DMACTIVE_LPCORE_V  0x00000001U
#define HP_CORE_DMACTIVE_LPCORE_S  0

/** HP_CORE_ERR_RESP_DIS_REG register
 *  need_des
 */
#define HP_CORE_ERR_RESP_DIS_REG (DR_REG_HP_SYS_BASE + 0x1a4)
/** HP_CORE_ERR_RESP_DIS : R/W; bitpos: [2:0]; default: 0;
 *  Set bit0 to disable ibus err resp. Set bit1 to disable dbus err resp.  Set bit 2 to
 *  disable ahb err resp.
 */
#define HP_CORE_ERR_RESP_DIS    0x00000007U
#define HP_CORE_ERR_RESP_DIS_M  (HP_CORE_ERR_RESP_DIS_V << HP_CORE_ERR_RESP_DIS_S)
#define HP_CORE_ERR_RESP_DIS_V  0x00000007U
#define HP_CORE_ERR_RESP_DIS_S  0

/** HP_CORE_TIMEOUT_INT_RAW_REG register
 *  Hp core bus timeout interrupt raw register
 */
#define HP_CORE_TIMEOUT_INT_RAW_REG (DR_REG_HP_SYS_BASE + 0x1a8)
/** HP_CORE0_AHB_TIMEOUT_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  the raw interrupt status of hp core0  ahb timeout
 */
#define HP_CORE0_AHB_TIMEOUT_INT_RAW    (BIT(0))
#define HP_CORE0_AHB_TIMEOUT_INT_RAW_M  (HP_CORE0_AHB_TIMEOUT_INT_RAW_V << HP_CORE0_AHB_TIMEOUT_INT_RAW_S)
#define HP_CORE0_AHB_TIMEOUT_INT_RAW_V  0x00000001U
#define HP_CORE0_AHB_TIMEOUT_INT_RAW_S  0
/** HP_CORE1_AHB_TIMEOUT_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  the raw interrupt status of hp core1  ahb timeout
 */
#define HP_CORE1_AHB_TIMEOUT_INT_RAW    (BIT(1))
#define HP_CORE1_AHB_TIMEOUT_INT_RAW_M  (HP_CORE1_AHB_TIMEOUT_INT_RAW_V << HP_CORE1_AHB_TIMEOUT_INT_RAW_S)
#define HP_CORE1_AHB_TIMEOUT_INT_RAW_V  0x00000001U
#define HP_CORE1_AHB_TIMEOUT_INT_RAW_S  1
/** HP_CORE0_IBUS_TIMEOUT_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  the raw interrupt status of hp core0  ibus timeout
 */
#define HP_CORE0_IBUS_TIMEOUT_INT_RAW    (BIT(2))
#define HP_CORE0_IBUS_TIMEOUT_INT_RAW_M  (HP_CORE0_IBUS_TIMEOUT_INT_RAW_V << HP_CORE0_IBUS_TIMEOUT_INT_RAW_S)
#define HP_CORE0_IBUS_TIMEOUT_INT_RAW_V  0x00000001U
#define HP_CORE0_IBUS_TIMEOUT_INT_RAW_S  2
/** HP_CORE1_IBUS_TIMEOUT_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  the raw interrupt status of hp core1  ibus timeout
 */
#define HP_CORE1_IBUS_TIMEOUT_INT_RAW    (BIT(3))
#define HP_CORE1_IBUS_TIMEOUT_INT_RAW_M  (HP_CORE1_IBUS_TIMEOUT_INT_RAW_V << HP_CORE1_IBUS_TIMEOUT_INT_RAW_S)
#define HP_CORE1_IBUS_TIMEOUT_INT_RAW_V  0x00000001U
#define HP_CORE1_IBUS_TIMEOUT_INT_RAW_S  3
/** HP_CORE0_DBUS_TIMEOUT_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  the raw interrupt status of hp core0  dbus timeout
 */
#define HP_CORE0_DBUS_TIMEOUT_INT_RAW    (BIT(4))
#define HP_CORE0_DBUS_TIMEOUT_INT_RAW_M  (HP_CORE0_DBUS_TIMEOUT_INT_RAW_V << HP_CORE0_DBUS_TIMEOUT_INT_RAW_S)
#define HP_CORE0_DBUS_TIMEOUT_INT_RAW_V  0x00000001U
#define HP_CORE0_DBUS_TIMEOUT_INT_RAW_S  4
/** HP_CORE1_DBUS_TIMEOUT_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  the raw interrupt status of hp core1  dbus timeout
 */
#define HP_CORE1_DBUS_TIMEOUT_INT_RAW    (BIT(5))
#define HP_CORE1_DBUS_TIMEOUT_INT_RAW_M  (HP_CORE1_DBUS_TIMEOUT_INT_RAW_V << HP_CORE1_DBUS_TIMEOUT_INT_RAW_S)
#define HP_CORE1_DBUS_TIMEOUT_INT_RAW_V  0x00000001U
#define HP_CORE1_DBUS_TIMEOUT_INT_RAW_S  5

/** HP_CORE_TIMEOUT_INT_ST_REG register
 *  masked interrupt register
 */
#define HP_CORE_TIMEOUT_INT_ST_REG (DR_REG_HP_SYS_BASE + 0x1ac)
/** HP_CORE0_AHB_TIMEOUT_INT_ST : RO; bitpos: [0]; default: 0;
 *  the masked interrupt status of hp core0  ahb timeout
 */
#define HP_CORE0_AHB_TIMEOUT_INT_ST    (BIT(0))
#define HP_CORE0_AHB_TIMEOUT_INT_ST_M  (HP_CORE0_AHB_TIMEOUT_INT_ST_V << HP_CORE0_AHB_TIMEOUT_INT_ST_S)
#define HP_CORE0_AHB_TIMEOUT_INT_ST_V  0x00000001U
#define HP_CORE0_AHB_TIMEOUT_INT_ST_S  0
/** HP_CORE1_AHB_TIMEOUT_INT_ST : RO; bitpos: [1]; default: 0;
 *  the masked interrupt status of hp core1  ahb timeout
 */
#define HP_CORE1_AHB_TIMEOUT_INT_ST    (BIT(1))
#define HP_CORE1_AHB_TIMEOUT_INT_ST_M  (HP_CORE1_AHB_TIMEOUT_INT_ST_V << HP_CORE1_AHB_TIMEOUT_INT_ST_S)
#define HP_CORE1_AHB_TIMEOUT_INT_ST_V  0x00000001U
#define HP_CORE1_AHB_TIMEOUT_INT_ST_S  1
/** HP_CORE0_IBUS_TIMEOUT_INT_ST : RO; bitpos: [2]; default: 0;
 *  the masked interrupt status of hp core0  ibus timeout
 */
#define HP_CORE0_IBUS_TIMEOUT_INT_ST    (BIT(2))
#define HP_CORE0_IBUS_TIMEOUT_INT_ST_M  (HP_CORE0_IBUS_TIMEOUT_INT_ST_V << HP_CORE0_IBUS_TIMEOUT_INT_ST_S)
#define HP_CORE0_IBUS_TIMEOUT_INT_ST_V  0x00000001U
#define HP_CORE0_IBUS_TIMEOUT_INT_ST_S  2
/** HP_CORE1_IBUS_TIMEOUT_INT_ST : RO; bitpos: [3]; default: 0;
 *  the masked interrupt status of hp core1  ibus timeout
 */
#define HP_CORE1_IBUS_TIMEOUT_INT_ST    (BIT(3))
#define HP_CORE1_IBUS_TIMEOUT_INT_ST_M  (HP_CORE1_IBUS_TIMEOUT_INT_ST_V << HP_CORE1_IBUS_TIMEOUT_INT_ST_S)
#define HP_CORE1_IBUS_TIMEOUT_INT_ST_V  0x00000001U
#define HP_CORE1_IBUS_TIMEOUT_INT_ST_S  3
/** HP_CORE0_DBUS_TIMEOUT_INT_ST : RO; bitpos: [4]; default: 0;
 *  the masked interrupt status of hp core0  dbus timeout
 */
#define HP_CORE0_DBUS_TIMEOUT_INT_ST    (BIT(4))
#define HP_CORE0_DBUS_TIMEOUT_INT_ST_M  (HP_CORE0_DBUS_TIMEOUT_INT_ST_V << HP_CORE0_DBUS_TIMEOUT_INT_ST_S)
#define HP_CORE0_DBUS_TIMEOUT_INT_ST_V  0x00000001U
#define HP_CORE0_DBUS_TIMEOUT_INT_ST_S  4
/** HP_CORE1_DBUS_TIMEOUT_INT_ST : RO; bitpos: [5]; default: 0;
 *  the masked interrupt status of hp core1  dbus timeout
 */
#define HP_CORE1_DBUS_TIMEOUT_INT_ST    (BIT(5))
#define HP_CORE1_DBUS_TIMEOUT_INT_ST_M  (HP_CORE1_DBUS_TIMEOUT_INT_ST_V << HP_CORE1_DBUS_TIMEOUT_INT_ST_S)
#define HP_CORE1_DBUS_TIMEOUT_INT_ST_V  0x00000001U
#define HP_CORE1_DBUS_TIMEOUT_INT_ST_S  5

/** HP_CORE_TIMEOUT_INT_ENA_REG register
 *  masked interrupt register
 */
#define HP_CORE_TIMEOUT_INT_ENA_REG (DR_REG_HP_SYS_BASE + 0x1b0)
/** HP_CORE0_AHB_TIMEOUT_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Write 1 to enable hp_core0_ahb_timeout int
 */
#define HP_CORE0_AHB_TIMEOUT_INT_ENA    (BIT(0))
#define HP_CORE0_AHB_TIMEOUT_INT_ENA_M  (HP_CORE0_AHB_TIMEOUT_INT_ENA_V << HP_CORE0_AHB_TIMEOUT_INT_ENA_S)
#define HP_CORE0_AHB_TIMEOUT_INT_ENA_V  0x00000001U
#define HP_CORE0_AHB_TIMEOUT_INT_ENA_S  0
/** HP_CORE1_AHB_TIMEOUT_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Write 1 to enable hp_core1_ahb_timeout int
 */
#define HP_CORE1_AHB_TIMEOUT_INT_ENA    (BIT(1))
#define HP_CORE1_AHB_TIMEOUT_INT_ENA_M  (HP_CORE1_AHB_TIMEOUT_INT_ENA_V << HP_CORE1_AHB_TIMEOUT_INT_ENA_S)
#define HP_CORE1_AHB_TIMEOUT_INT_ENA_V  0x00000001U
#define HP_CORE1_AHB_TIMEOUT_INT_ENA_S  1
/** HP_CORE0_IBUS_TIMEOUT_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  Write 1 to enable hp_core0_ibus_timeout int
 */
#define HP_CORE0_IBUS_TIMEOUT_INT_ENA    (BIT(2))
#define HP_CORE0_IBUS_TIMEOUT_INT_ENA_M  (HP_CORE0_IBUS_TIMEOUT_INT_ENA_V << HP_CORE0_IBUS_TIMEOUT_INT_ENA_S)
#define HP_CORE0_IBUS_TIMEOUT_INT_ENA_V  0x00000001U
#define HP_CORE0_IBUS_TIMEOUT_INT_ENA_S  2
/** HP_CORE1_IBUS_TIMEOUT_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  Write 1 to enable hp_core1_ibus_timeout int
 */
#define HP_CORE1_IBUS_TIMEOUT_INT_ENA    (BIT(3))
#define HP_CORE1_IBUS_TIMEOUT_INT_ENA_M  (HP_CORE1_IBUS_TIMEOUT_INT_ENA_V << HP_CORE1_IBUS_TIMEOUT_INT_ENA_S)
#define HP_CORE1_IBUS_TIMEOUT_INT_ENA_V  0x00000001U
#define HP_CORE1_IBUS_TIMEOUT_INT_ENA_S  3
/** HP_CORE0_DBUS_TIMEOUT_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  Write 1 to enable hp_core0_dbus_timeout int
 */
#define HP_CORE0_DBUS_TIMEOUT_INT_ENA    (BIT(4))
#define HP_CORE0_DBUS_TIMEOUT_INT_ENA_M  (HP_CORE0_DBUS_TIMEOUT_INT_ENA_V << HP_CORE0_DBUS_TIMEOUT_INT_ENA_S)
#define HP_CORE0_DBUS_TIMEOUT_INT_ENA_V  0x00000001U
#define HP_CORE0_DBUS_TIMEOUT_INT_ENA_S  4
/** HP_CORE1_DBUS_TIMEOUT_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  Write 1 to enable hp_core1_dbus_timeout int
 */
#define HP_CORE1_DBUS_TIMEOUT_INT_ENA    (BIT(5))
#define HP_CORE1_DBUS_TIMEOUT_INT_ENA_M  (HP_CORE1_DBUS_TIMEOUT_INT_ENA_V << HP_CORE1_DBUS_TIMEOUT_INT_ENA_S)
#define HP_CORE1_DBUS_TIMEOUT_INT_ENA_V  0x00000001U
#define HP_CORE1_DBUS_TIMEOUT_INT_ENA_S  5

/** HP_CORE_TIMEOUT_INT_CLR_REG register
 *  interrupt clear register
 */
#define HP_CORE_TIMEOUT_INT_CLR_REG (DR_REG_HP_SYS_BASE + 0x1b4)
/** HP_CORE0_AHB_TIMEOUT_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Write 1 to clear hp_core0_ahb_timeout int
 */
#define HP_CORE0_AHB_TIMEOUT_INT_CLR    (BIT(0))
#define HP_CORE0_AHB_TIMEOUT_INT_CLR_M  (HP_CORE0_AHB_TIMEOUT_INT_CLR_V << HP_CORE0_AHB_TIMEOUT_INT_CLR_S)
#define HP_CORE0_AHB_TIMEOUT_INT_CLR_V  0x00000001U
#define HP_CORE0_AHB_TIMEOUT_INT_CLR_S  0
/** HP_CORE1_AHB_TIMEOUT_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Write 1 to clear hp_core1_ahb_timeout int
 */
#define HP_CORE1_AHB_TIMEOUT_INT_CLR    (BIT(1))
#define HP_CORE1_AHB_TIMEOUT_INT_CLR_M  (HP_CORE1_AHB_TIMEOUT_INT_CLR_V << HP_CORE1_AHB_TIMEOUT_INT_CLR_S)
#define HP_CORE1_AHB_TIMEOUT_INT_CLR_V  0x00000001U
#define HP_CORE1_AHB_TIMEOUT_INT_CLR_S  1
/** HP_CORE0_IBUS_TIMEOUT_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Write 1 to clear hp_core0_ibus_timeout int
 */
#define HP_CORE0_IBUS_TIMEOUT_INT_CLR    (BIT(2))
#define HP_CORE0_IBUS_TIMEOUT_INT_CLR_M  (HP_CORE0_IBUS_TIMEOUT_INT_CLR_V << HP_CORE0_IBUS_TIMEOUT_INT_CLR_S)
#define HP_CORE0_IBUS_TIMEOUT_INT_CLR_V  0x00000001U
#define HP_CORE0_IBUS_TIMEOUT_INT_CLR_S  2
/** HP_CORE1_IBUS_TIMEOUT_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Write 1 to clear hp_core1_ibus_timeout int
 */
#define HP_CORE1_IBUS_TIMEOUT_INT_CLR    (BIT(3))
#define HP_CORE1_IBUS_TIMEOUT_INT_CLR_M  (HP_CORE1_IBUS_TIMEOUT_INT_CLR_V << HP_CORE1_IBUS_TIMEOUT_INT_CLR_S)
#define HP_CORE1_IBUS_TIMEOUT_INT_CLR_V  0x00000001U
#define HP_CORE1_IBUS_TIMEOUT_INT_CLR_S  3
/** HP_CORE0_DBUS_TIMEOUT_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Write 1 to clear hp_core0_dbus_timeout int
 */
#define HP_CORE0_DBUS_TIMEOUT_INT_CLR    (BIT(4))
#define HP_CORE0_DBUS_TIMEOUT_INT_CLR_M  (HP_CORE0_DBUS_TIMEOUT_INT_CLR_V << HP_CORE0_DBUS_TIMEOUT_INT_CLR_S)
#define HP_CORE0_DBUS_TIMEOUT_INT_CLR_V  0x00000001U
#define HP_CORE0_DBUS_TIMEOUT_INT_CLR_S  4
/** HP_CORE1_DBUS_TIMEOUT_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Write 1 to clear hp_core1_dbus_timeout int
 */
#define HP_CORE1_DBUS_TIMEOUT_INT_CLR    (BIT(5))
#define HP_CORE1_DBUS_TIMEOUT_INT_CLR_M  (HP_CORE1_DBUS_TIMEOUT_INT_CLR_V << HP_CORE1_DBUS_TIMEOUT_INT_CLR_S)
#define HP_CORE1_DBUS_TIMEOUT_INT_CLR_V  0x00000001U
#define HP_CORE1_DBUS_TIMEOUT_INT_CLR_S  5

/** HP_GPIO_O_HYS_CTRL0_REG register
 *  NA
 */
#define HP_GPIO_O_HYS_CTRL0_REG (DR_REG_HP_SYS_BASE + 0x1c0)
/** HP_REG_GPIO_0_HYS_LOW : R/W; bitpos: [31:0]; default: 0;
 *  hys control for gpio47~16
 */
#define HP_REG_GPIO_0_HYS_LOW    0xFFFFFFFFU
#define HP_REG_GPIO_0_HYS_LOW_M  (HP_REG_GPIO_0_HYS_LOW_V << HP_REG_GPIO_0_HYS_LOW_S)
#define HP_REG_GPIO_0_HYS_LOW_V  0xFFFFFFFFU
#define HP_REG_GPIO_0_HYS_LOW_S  0

