espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_reg.h
/** HP_GPIO_O_HYS_CTRL1_REG register
 *  NA
 */
#define HP_GPIO_O_HYS_CTRL1_REG (DR_REG_HP_SYS_BASE + 0x1c4)
/** HP_REG_GPIO_0_HYS_HIGH : R/W; bitpos: [8:0]; default: 0;
 *  hys control for gpio56~48
 */
#define HP_REG_GPIO_0_HYS_HIGH    0x000001FFU
#define HP_REG_GPIO_0_HYS_HIGH_M  (HP_REG_GPIO_0_HYS_HIGH_V << HP_REG_GPIO_0_HYS_HIGH_S)
#define HP_REG_GPIO_0_HYS_HIGH_V  0x000001FFU
#define HP_REG_GPIO_0_HYS_HIGH_S  0

/** HP_RSA_PD_CTRL_REG register
 *  rsa pd ctrl register
 */
#define HP_RSA_PD_CTRL_REG (DR_REG_HP_SYS_BASE + 0x1d0)
/** HP_RSA_MEM_FORCE_PD : R/W; bitpos: [0]; default: 0;
 *  Set this bit to power down rsa internal memory.
 */
#define HP_RSA_MEM_FORCE_PD    (BIT(0))
#define HP_RSA_MEM_FORCE_PD_M  (HP_RSA_MEM_FORCE_PD_V << HP_RSA_MEM_FORCE_PD_S)
#define HP_RSA_MEM_FORCE_PD_V  0x00000001U
#define HP_RSA_MEM_FORCE_PD_S  0
/** HP_RSA_MEM_FORCE_PU : R/W; bitpos: [1]; default: 1;
 *  Set this bit to force power up rsa internal memory
 */
#define HP_RSA_MEM_FORCE_PU    (BIT(1))
#define HP_RSA_MEM_FORCE_PU_M  (HP_RSA_MEM_FORCE_PU_V << HP_RSA_MEM_FORCE_PU_S)
#define HP_RSA_MEM_FORCE_PU_V  0x00000001U
#define HP_RSA_MEM_FORCE_PU_S  1
/** HP_RSA_MEM_PD : R/W; bitpos: [2]; default: 0;
 *  Set this bit to force power down rsa internal memory.
 */
#define HP_RSA_MEM_PD    (BIT(2))
#define HP_RSA_MEM_PD_M  (HP_RSA_MEM_PD_V << HP_RSA_MEM_PD_S)
#define HP_RSA_MEM_PD_V  0x00000001U
#define HP_RSA_MEM_PD_S  2

/** HP_ECC_PD_CTRL_REG register
 *  ecc pd ctrl register
 */
#define HP_ECC_PD_CTRL_REG (DR_REG_HP_SYS_BASE + 0x1d4)
/** HP_ECC_MEM_FORCE_PD : R/W; bitpos: [0]; default: 0;
 *  Set this bit to power down ecc internal memory.
 */
#define HP_ECC_MEM_FORCE_PD    (BIT(0))
#define HP_ECC_MEM_FORCE_PD_M  (HP_ECC_MEM_FORCE_PD_V << HP_ECC_MEM_FORCE_PD_S)
#define HP_ECC_MEM_FORCE_PD_V  0x00000001U
#define HP_ECC_MEM_FORCE_PD_S  0
/** HP_ECC_MEM_FORCE_PU : R/W; bitpos: [1]; default: 1;
 *  Set this bit to force power up ecc internal memory
 */
#define HP_ECC_MEM_FORCE_PU    (BIT(1))
#define HP_ECC_MEM_FORCE_PU_M  (HP_ECC_MEM_FORCE_PU_V << HP_ECC_MEM_FORCE_PU_S)
#define HP_ECC_MEM_FORCE_PU_V  0x00000001U
#define HP_ECC_MEM_FORCE_PU_S  1
/** HP_ECC_MEM_PD : R/W; bitpos: [2]; default: 0;
 *  Set this bit to force power down ecc internal memory.
 */
#define HP_ECC_MEM_PD    (BIT(2))
#define HP_ECC_MEM_PD_M  (HP_ECC_MEM_PD_V << HP_ECC_MEM_PD_S)
#define HP_ECC_MEM_PD_V  0x00000001U
#define HP_ECC_MEM_PD_S  2

/** HP_RNG_CFG_REG register
 *  rng cfg register
 */
#define HP_RNG_CFG_REG (DR_REG_HP_SYS_BASE + 0x1d8)
/** HP_RNG_SAMPLE_ENABLE : R/W; bitpos: [0]; default: 0;
 *  enable rng sample chain
 */
#define HP_RNG_SAMPLE_ENABLE    (BIT(0))
#define HP_RNG_SAMPLE_ENABLE_M  (HP_RNG_SAMPLE_ENABLE_V << HP_RNG_SAMPLE_ENABLE_S)
#define HP_RNG_SAMPLE_ENABLE_V  0x00000001U
#define HP_RNG_SAMPLE_ENABLE_S  0
/** HP_RNG_CHAIN_CLK_DIV_NUM : R/W; bitpos: [23:16]; default: 0;
 *  chain clk div num to pad for debug
 */
#define HP_RNG_CHAIN_CLK_DIV_NUM    0x000000FFU
#define HP_RNG_CHAIN_CLK_DIV_NUM_M  (HP_RNG_CHAIN_CLK_DIV_NUM_V << HP_RNG_CHAIN_CLK_DIV_NUM_S)
#define HP_RNG_CHAIN_CLK_DIV_NUM_V  0x000000FFU
#define HP_RNG_CHAIN_CLK_DIV_NUM_S  16
/** HP_RNG_SAMPLE_CNT : RO; bitpos: [31:24]; default: 0;
 *  debug rng sample cnt
 */
#define HP_RNG_SAMPLE_CNT    0x000000FFU
#define HP_RNG_SAMPLE_CNT_M  (HP_RNG_SAMPLE_CNT_V << HP_RNG_SAMPLE_CNT_S)
#define HP_RNG_SAMPLE_CNT_V  0x000000FFU
#define HP_RNG_SAMPLE_CNT_S  24

/** HP_UART_PD_CTRL_REG register
 *  ecc pd ctrl register
 */
#define HP_UART_PD_CTRL_REG (DR_REG_HP_SYS_BASE + 0x1dc)
/** HP_UART_MEM_FORCE_PD : R/W; bitpos: [0]; default: 0;
 *  Set this bit to power down hp uart internal memory.
 */
#define HP_UART_MEM_FORCE_PD    (BIT(0))
#define HP_UART_MEM_FORCE_PD_M  (HP_UART_MEM_FORCE_PD_V << HP_UART_MEM_FORCE_PD_S)
#define HP_UART_MEM_FORCE_PD_V  0x00000001U
#define HP_UART_MEM_FORCE_PD_S  0
/** HP_UART_MEM_FORCE_PU : R/W; bitpos: [1]; default: 1;
 *  Set this bit to force power up hp uart  internal memory
 */
#define HP_UART_MEM_FORCE_PU    (BIT(1))
#define HP_UART_MEM_FORCE_PU_M  (HP_UART_MEM_FORCE_PU_V << HP_UART_MEM_FORCE_PU_S)
#define HP_UART_MEM_FORCE_PU_V  0x00000001U
#define HP_UART_MEM_FORCE_PU_S  1

/** HP_PERI_MEM_CLK_FORCE_ON_REG register
 *  hp peri mem clk force on regpster
 */
#define HP_PERI_MEM_CLK_FORCE_ON_REG (DR_REG_HP_SYS_BASE + 0x1e0)
/** HP_RMT_MEM_CLK_FORCE_ON : R/W; bitpos: [0]; default: 0;
 *  Set this bit to force on mem clk in rmt
 */
#define HP_RMT_MEM_CLK_FORCE_ON    (BIT(0))
#define HP_RMT_MEM_CLK_FORCE_ON_M  (HP_RMT_MEM_CLK_FORCE_ON_V << HP_RMT_MEM_CLK_FORCE_ON_S)
#define HP_RMT_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_RMT_MEM_CLK_FORCE_ON_S  0
/** HP_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON : R/W; bitpos: [1]; default: 0;
 *  Set this bit to force on tx mem clk in bitscrambler
 */
#define HP_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON    (BIT(1))
#define HP_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON_M  (HP_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON_V << HP_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON_S)
#define HP_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON_S  1
/** HP_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON : R/W; bitpos: [2]; default: 0;
 *  Set this bit to force on rx mem clk in bitscrambler
 */
#define HP_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON    (BIT(2))
#define HP_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON_M  (HP_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON_V << HP_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON_S)
#define HP_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON_S  2
/** HP_GDMA_MEM_CLK_FORCE_ON : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force on mem clk in gdma
 */
#define HP_GDMA_MEM_CLK_FORCE_ON    (BIT(3))
#define HP_GDMA_MEM_CLK_FORCE_ON_M  (HP_GDMA_MEM_CLK_FORCE_ON_V << HP_GDMA_MEM_CLK_FORCE_ON_S)
#define HP_GDMA_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_GDMA_MEM_CLK_FORCE_ON_S  3

#ifdef __cplusplus
}
#endif
